[
  {
    "text": "I have had Nest products for about 8 year in my 2 homes. I have enjoyed being able to monitor and manage the temperatures at each home at any time. I have not found the Protect product as useful. I went all in a brought 5 Protects and found them to be supper expensive and annoying to maintain. After about 6-8 years Nest will send you a notice that you Protect will no longer work and you have to replace it with a new. The other annoyance it takes allot of batteries 6-8 that don’t last that long. It test it self once a month which is annoying and create a lot of unnecessary messages and disruption. Given the cost of batteries and the device and frequent messages I have decide not to replace theProtect as they obsolete. I will just replace them with stand alone 10 year maintenance free devices and save a fair amount of money and aggravation. When I started with nest they were just Nest but now that Google owns them ever time I sign it to maintain my device Google wants me to switch over to my Google account to manage them. I use a lot of Google products but at some point I want to restrict how much info they have on me so I keep saying no I don’t want to switch to Google. It is very annoying.",
    "title": "Long term user",
    "posted_at": "2021-01-09 09:54:49.000000 UTC"
  },
  {
    "text": "Like all these types of apps, there is a delay activating it and connecting to the sensors or cameras.\nI also found it impossible to get three thermostats to connect. They seem to connect on their own mesh network and so even if you have strong WiFi the devices may not all register and see each other. I had to fake a second house to get the one in my basement to work at all. It’s fine, but it’s not connected to the other two sensors and it seems that’s part of the benefit as they are supposed to work together.\nOne final point. If your electric goes out, you have a 1-2 hour back up battery. After that you have no heat. I have not tested this but thats important to know if you are dealing with heavy winter storms. I was surprised that the back up battery was not of longer duration. Seems like an easy solve.\nI would recommend keeping either your old thermostats in case you need them in an emergency or having some way to charge the nest faceplate if you had to. (There is a USB port but haven’t tested that and again you will take an hour or three to charge it for an hour or two of use. Not ideal).",
    "title": "Slow and finicky",
    "posted_at": "2021-02-18 15:42:47.000000 UTC"
  },
  {
    "text": "Nest app says you can’t add a family member because of Google Home. This is a “Critical Safety” addition to my home. Crippling the Nest app to force me to go to Google Home just so I can add a family member to monitor the safety of my home is absolutely ridiculous. I wouldn’t have bought it if I have to work between two ecosystems to get it to work with my family.\nNo more Nest products for me.",
    "title": "Smoke Alarm can’t share with Family",
    "posted_at": "2021-04-21 12:43:06.000000 UTC"
  },
  {
    "text": "The app works but is not that user friendly and lacks of basic features, probably because of its old design. The support of the sensors is done like a patch (when you are able to add them…in my old apartment I had a ticket open for 3 months before getting it fixed and being able to add them), meaning that is not properly designed and integrated. You can see the temperatures of the different sensors but you can only set one sensor to trigger the AC manually or based on only 4 time slots of the day, regardless of the day of the week, which is a big limitation. Should it be clever enough to calculate the average of the temperature of all the sensors of the house and use it to set the temperature or the average of specific sensors? Yes, it should…but it doesn’t!! What a big disappointment.\nLast: there is no “snooze” / pause button if you want to temporarily stop the air from blowing : you have to change the temperature to do that and then change again when you want it to start again.\nI think it’s time to rethink completely at the app with the features in mind of the 2021.",
    "title": "Missing basic features and old design",
    "posted_at": "2021-09-14 04:03:32.000000 UTC"
  },
  {
    "text": "I have had the Nest for about a month now. Initially, the learning feature worked great. However, as summer approaches it’s getting warmer faster than I can create inputs for the device. So, I’m waking up in the middle of night to a boiling home. When I attempt to manually make changes to the schedule, a few glaring issues arise: (1) it’s impossible to make broad changes across multiple days (2) it’s literally impossible to delete temperature changes - once the Nest has added a temperature change you are stuck with it - I have instances where the temperature schedule requires 3-4 adjustments in the same 3-4 hour span of time. Brutal. I have an iPhone X - there are Most certainly bugs in the app that inhibit the user from rapidly making changes to the schedule (3) the app forces you to use this non intuitive landscape mode for schedule changes, additionally - the schedule settings screen is so poorly designed and requires you to press buttons on your iPhone in a ridiculously precise way.\nI’m frankly shocked the app experience is so poor given this is a google acquired company. I wish I had gone with another brand entirely, with a newer app.",
    "title": "Impossible to change, thumbs down v2",
    "posted_at": "2021-06-14 10:18:38.000000 UTC"
  },
  {
    "text": "Not sure what happened to the Nest thermostat product line, either Google took over and tweaked the product to their specifications, or Nest produced a product that was meant to be disposable and then sold it to Google...\nMy two year old nest thermostat woke up one day and decided that it couldn’t/wouldn’t connect to my wifi. No reason, that Google would admit to, just because it felt the need to be independent I guess? After a day of back and forth with google support, they graciously offered to replace my two year old thermostat (just a few months out of warranty... what happened to products that were designed to last and last and last???). I waited the week to get my new thermostat and just finished the almost two hour installation process... same issue as before, first it couldn’t/wouldn’t find my wifi network, then when it finally found it, it wouldn’t/couldn’t connect (keep claiming the password was incorrect...no it wasn’t), then when it finally conceded to doing what it was designed to do, it wouldn’t connect to my nest app on my iPhone... after several resets and retry’s, I was finally able to convince the two products to communicate with each other... probably my last nest product... my A/C guy says go with Honeywell... think I will next time...",
    "title": "Google ruined Nest",
    "posted_at": "2021-03-04 20:22:42.000000 UTC"
  },
  {
    "text": "A few weeks ago, a message came up on the thermostat that we could save energy by going into Eco mode scheduling. That sounded fine to me. However, it turns out that just means that it turned the temperature down to 56° in the middle of the night and leaves it there, so that it’s freezing in the house in the morning. I looked at all the scheduling in the app and everything seem fine, but it wasn’t syncing with what the thermostats said, which was to take the temperature down to 56°, and then occasionally raise it to 62°. When you change the temperature manually, that would only last a few hours.\nI eventually figured out how to remove all of the programming, which is kind of a bummer because now there’s nothing really smart about the thermostat at all except that I can change it remotely from my phone. I will go back to doing some sort of scheduling, but I strongly suggest that you don’t except the Nest recommendation to let it do it for you. Too bad, because it would be a helpful and energy saving feature if it worked, but it’s not ready for prime time.",
    "title": "The new Eco mode function takes over control of the scheduling in a way that is difficult to manage",
    "posted_at": "2021-12-28 01:19:04.000000 UTC"
  },
  {
    "text": "We purchased this unit years ago. It was easy to install and contained very helpful instructions. Once we install the app we were set. I enjoy the fact that at night I don't have to get up to change the temperature on the thermostat. Our home is rather large and has a very strong blowing unit. Since the temperature we set on the thermostat doesn't always need to be the same temperature it tends to cause me to get up several times at night to adjust the thermostat. Now I can just pick up my phone and push arrow down or arrow up to the set the temperature I want and I'm good to go. I also like the preprogramming aspect. I would recommend this to anyone that wants to make life easier. The price was a little high but I'm hoping it will save me in my utility bill so I can at the very least break even.\nNegative aspects: the app keeps logging me out sometimes 3x a day and then makes we verify my Google credentials to log in. It Doesn’t work consistently with Lenovo products like the clock radio when I say Google set upstairs to 75 the Lenovo product proceeds to tell me that product is not set up yet you need to set it up again even though we both know it’s set up. this will happen sometimes 3 to 4 times before it finally does what I need it to.",
    "title": "Easy to use",
    "posted_at": "2022-09-22 14:16:15.000000 UTC"
  },
  {
    "text": "Can something be done about the constant crashing.\nYou try to review footage as it’s designed to do, to only keep getting kicked out and having to find that footage again and again!!!",
    "title": "App keeps crashing",
    "posted_at": "2021-04-04 02:34:40.000000 UTC"
  },
  {
    "text": "In Australia, thermostat is inconsistently wrong by 2 hours. And sometimes the time is correct. Today, out by 2 hours, then correct, note out again. Makes it useless to set a schedule. Get your time servers working correctly. Been happening for a couple of months now",
    "title": "Thermostat doesn’t keep correct time",
    "posted_at": "2022-06-22 12:59:57.000000 UTC"
  },
  {
    "text": "I changed my Wifi network and had to subsequently update the Nest Protect so it could connect. The process of updating the wifi settings was riddled with mysterious errors forcing me to restart the process many times.",
    "title": "Consistent trouble with set up",
    "posted_at": "2020-11-07 07:40:39.000000 UTC"
  },
  {
    "text": "Door bell sucks as it sometimes works and often, it will delayed by so long that you miss the person who rang it.",
    "title": "Doorbell sucks!",
    "posted_at": "2022-04-10 02:58:41.000000 UTC"
  },
  {
    "text": "My cameras detect motion every hour or so for something as small as a bird passing through the gardens.\nWorst part of all is the app is laggy and rarely allows me to playback any of the recorded videos. For $9 a month they can forget about it until they fix these problems.",
    "title": "Unable to playback most videos",
    "posted_at": "2021-07-02 23:50:18.000000 UTC"
  },
  {
    "text": "Eco auto on sucks it sucks",
    "title": "Eco leaf",
    "posted_at": "2022-06-23 23:22:35.000000 UTC"
  },
  {
    "text": "I bought my nest thermostat before Google took over. Before Google the Nest thermostat was truly innovative and frequently offered new features that consumers desired for energy savings, increased comfort options along with better systems integration. Since Google took over however there seems to be a dearth of new features being offered. Some original features seem to have been removed like how my Nest thermostat used to preheat and start cooling the house before I would come home from work as it was smart enough to know the approximate time I’d arrive at home each day. Until Apple recently implemented its app privacy requirements google would frequently put out regular updates to its app. It has literally been over 2 months since google has released an update. Never can I recall the app going that long between updates. It makes me wonder why the Nest app has gone this long without an update. Is there something that Google does not want me to know about how they track and use my data?",
    "title": "Disappointed and letdown by google",
    "posted_at": "2021-03-03 00:35:15.000000 UTC"
  },
  {
    "text": "It is short recorded videos and it does not stay for long to be available so checking videos after a while is not possible",
    "title": "Not much memory",
    "posted_at": "2022-08-21 02:47:43.000000 UTC"
  },
  {
    "text": "Bought the Nest cam and Nest Protect to go with our Nest home hub and the rest of our nest(google) speakers, lights and devices. They can’t merge onto one app, so we have to switch between google home and nest to view and/or use all of our devices. Not happy!",
    "title": "Not compatible?!",
    "posted_at": "2021-04-19 05:37:04.000000 UTC"
  },
  {
    "text": "Our nest was installed in the fall for the heating season and had worked fine until we returned from a 5 day trip away for New Years weekend. We found the house at 40 degrees and the nest had basically shut off our furnace. We could not get it started and had to call our oil company to troubleshoot it. We normally set our temp at 60 while away and the history of furnace usage said the furnace was not on for the 2 days before we got home, yet the nest sent us a message that the temp was normal that morning at 5am. There was nothing normal about the house conditions at that time. The house temp was in the mid to low 40’s when it sent that message. We were lucky our pipes did not freeze. Needless to say the algorithm has a big problem and we are not happy with the nest. We just went away for a day and kept checking it remotely to make sure it was going wacky again. I think the nest programmers need to seriously check their learning algorithms for some problem. Be careful other users.",
    "title": "Shut off furnace while we’re away and nearly froze our pipes",
    "posted_at": "2022-01-10 00:58:50.000000 UTC"
  },
  {
    "text": "As I write this review, it is completely appropriate that I cannot see any of the words I am writing in the Nest app. It is really funny, actually. Maybe it’s be because I’m giving the entire ecosystem 2 stars. Sadly, to say Nest is “learning” would be a misnomer. I can set a schedule and within seconds, go back to it and find that Nest has changed that schedule, sometimes drastically. Sometimes, especially in the summer, despite me being home and despite me walking past either of our Nest thermostats, I’ll notice that the thermostats have crept up to terribly hot levels, I conducive to comfort or even to a person’s health. If I hadn’t invested so much in all of our Google devices throughout our home, I’d trash these products and start with another brand. Unfortunately, we are saddled with dozens of Google products throughout our home that work occasionally the way they were meant to run, but usually cause far too many problems for what they are worth. It’s a poor ecosystem. Then again, why am I even writing this review, considering the fact that I cannot even see what I am writing.",
    "title": "“Learning” thermostat",
    "posted_at": "2021-09-15 06:13:00.000000 UTC"
  },
  {
    "text": "I just want it to be the temperature I want it to be. I don’t care about the energy. There are way too many energy features. Even when I think I have it turned off. It’s now 2am and it’s still hotter than I want in my house. The fact I’m up writing this review should tell you something.",
    "title": "Not impressed",
    "posted_at": "2020-07-18 06:34:48.000000 UTC"
  },
  {
    "text": "Despite disabling all the auto temperature settings, it keeps changing to whatever it wants. Now it came with ‘seasonal savings’ and there is no way to change it",
    "title": "Hate it",
    "posted_at": "2021-02-06 03:34:13.000000 UTC"
  },
  {
    "text": "Expect to not be able to login through the app a few days after every ios update.\nperpetually gives a message saying ‘cookies aren’t enabled’ even if they are.",
    "title": "Breaks with ios updates",
    "posted_at": "2020-11-02 21:06:35.000000 UTC"
  },
  {
    "text": "The app is awful in terms of the door bell footage. The front door footage never loads and gets false triggered all the time. The actual door bell itself doesn’t chime when u ring it even though chime is on in the settings. If you need a good reliable doorbell and a good reliable app I recommend ring 10 time out of 10",
    "title": "App sucks get a ring doorbell instead",
    "posted_at": "2022-02-05 18:18:03.000000 UTC"
  },
  {
    "text": "I’ve had 2 nest outdoor cameras at my home for several years and my experience can be summed up in the title of the review. The lag/buffering is atrocious. I’ve tested the WiFi signal strength from each camera’s location and get full signal from both spots. Also worth mentioning I have gigabit internet along with a top of the line modem & the Rolls Royce of routers from Netgear and everything else in the house runs flawlessly. It’s extremely frustrating when you hear a strange noise during the night and open the app to check your cameras only to be greeted by a never ending spinning blue circle. Don’t bother calling customer service, they will inevitably tell you that you have subpar connection or slow internet speeds. The only saving grace is that the nest cam IQ outdoor I have at my lake house has worked pretty much without issue since I installed it about 5 months ago. Only wish I could say the same for the other 2 at my house. Would not recommend these cameras to anyone. When you need to know what is going on outside of your home in a moments notice, Nest will let you down.",
    "title": "Endless Buffering",
    "posted_at": "2020-01-23 03:43:42.000000 UTC"
  },
  {
    "text": "Don’t get me wrong I love nest and nest products they are great. However, I have the Nest E and I wish that there was a temperature hold feature for this or something similar to that. I have attempted to troubleshoot this problem by clearing out The schedule and setting it two times but it always reverts back to Eco or the temperature goes up. I work nights which means I sleep during the day and since I live in a hot dry air and state waking up at 1300 hrs drenched in sweat because The thermostat and the app didn’t talk to each other showing my location and the thermostat were in the same place; the schedule that I set up wasn’t followed; or the fact that the thermostat did not detect any motion for an extended period of time. Not only is this a problem when I am sleeping on my work days as a nurse, but it’s also a problem on my off days when I just want to spend the morning in bed and after six or 7 AM it throws the temperature up to 86°.\nGoogle developers I know you can fix this and I hope you can even if it means downloading firmware to help and upgrading the app. I also know that these are changing times and more people are at home so even more now than ever the thermostat doesn’t know what the hell it’s doing because we are all home now. But you would really help an ER nurse out if you could truly get this fixed on the Nest E and other thermostat.\nThanks",
    "title": "Needs hold feature and to be night shift worker friendly",
    "posted_at": "2020-05-20 03:12:53.000000 UTC"
  },
  {
    "text": "I have 5 Nest Protect smoke/CO2 detectors set up in my home. The app keeps track of what state each detector is in, when it goes through testing, etc. My system worked for 6 months then... nothing. I could see the detectors, I could test them through my phone and through my iPad, but the app said they couldn’t be communicated with. I got in touch with Tech Support and went through 2 more hours of going through all the troubleshooting steps you can get online. The person helping me then said I had to remove each detector and reinstall it. I asked if this was normal... removing and reinstalling every 6 months. I never got an answer that. Anyhow, I removed and replaced each detector and finally got all of them talking again.\nThis isn’t my first rodeo with Nest. I have another home and those devices have been there for about 3 years. I never have a problem with them. But this house... that’s a terrible solution... it doesn’t tell you why things happened, just that it happened. I’m concerned that I’m going to have to do this again in 6 months.",
    "title": "Is It The App?",
    "posted_at": "2021-02-17 00:08:29.000000 UTC"
  },
  {
    "text": "It’s officially been a month and I’m starting to think the extra bucks was not worth it for a Smart Thermostat. It constantly thinks there’s no one home if we stay in our rooms, and suddenly you have a headache and are burning up because this little thing has set your home temperature to 78 in summertime. I find myself constantly adjusting it the right temperature only to find that it thinks that’s not right and sets it right back up. It’s advertised as learning what you like and creating a schedule lol… well, I can tell you we try to keep it between 72-74 when we are home yet this morning after reviewing why I woke up again to 78, I found out the app was set automatically to that tempt for the rest of the day. Even after I set the max temperature to 75 hoping it would keep it from ever getting that hot in 98 summer temps. The app itself can be a little tricky to figure out. Specially the scheduling. You have to adjust each day and time individually. So far have not found a way to say for ex: M-F do this at this time.",
    "title": "Smart Thermostat Not So Smart",
    "posted_at": "2022-06-22 14:48:34.000000 UTC"
  },
  {
    "text": "It’s so much work to keep on top of the changing temperatures throughout each season. I don’t want to have to constantly switch between Heat, Cool, and Heat-Cool modes. For the Heat-Cool mode, having a window of 3 degrees of accuracy on the temperature makes it so that when you want to cool the house to the upper limit during the day, at night time it will be too cold because the temperature drops to the lower temperature limit. So I have to raise it at night. Maybe we are temperature picky people but like all other thermostats I’ve had, I wish Nest would let me choose one temperature to either heat or cool to, and the Nest decides if it needs to heat or cool without needing my input. I don’t care if the AC system is heating or cooling, I just want one temperature selection.\nLast point, the the scheduling tab needs a complete redesign. Why are there no vertical and horizontal guidelines? I have to hold my finger down and hope I select the right temperature and time without shifting my finger too far one way. Also, placing a temperature change at midnight has issues. It won’t select exactly at midnight.\nThat being said, I really appreciate the notification emails I get if something seems to be wrong with our AC system.",
    "title": "The scheduling section needs revising",
    "posted_at": "2022-07-02 23:00:37.000000 UTC"
  },
  {
    "text": "Worked great in -40 temp to 104degree F temperatures, night/Day, worked great for really almost a year. The girlfriend changed the WiFi password about a week ago, and since then I have tried and tried to get back in to the camera, it just won’t connect, google has no support for it in the end. Just leads you around for trouble shoot your issues, I only keep getting the C100-C119 codes. Trouble shoot them atleast 3 times a day for the last week. NO LUCK AT RECONNECTING. Google says try using your old password, umm yeah okay so change wifi back to original password, reset everything uninstalled the app etc etc tried to connect with it and still nothing. So changed password again disconnected everything then rebooted it all left the camera plugged in and gave it the password again, wouldn’t connect to wifi, dun matter how close u bring it to the router it won’t connect. Anyways I left it alone for almost the whole day and it connected for about 5mins. Then it just lost connection again. So $188 don’t seem like much to a lot of ppl but it’s a lot to me. ALSO GOOGLE JUST TOOK $60 from me to renew the fkin yearly plan for data I did cancel it and still yet to be reimbursed so there’s that too.",
    "title": "Works great until you change the WiFi Password",
    "posted_at": "2021-07-13 21:11:58.000000 UTC"
  },
  {
    "text": "This is more of a review for the nest device itself, the app being a secondary factor. It does seem to work/run more smoothly and consistently then the ecobee I previously had but only marginally. When it’s actually functioning, my biggest complaint is that it won’t allow you to set a temperature. It autocorrects to w/e temperature it ‘thinks’ it should be. When the device is fully charged it works fine enough but it only stays charged for a few hours at most and inevitably disconnects from wifi and the app due to low battery. This is when the thermostat stops responding and decides to maintain a 74 degree temperature no matter how many times I readjust it. Then I have to pull it off the wall and plug it in until it’s charged enough to work again which can take anywhere from 5 minutes to an hour and only works half the time. Some times I have to reset the device in addition to charging it before it will work. This is a daily occurrence. Not only is it frustrating and annoying but my pet St Bernard really doesn’t appreciate it. 74 is about 15 degrees too hot for him and it’s not so great for me either.",
    "title": "Not horrible, not amazing, super annoying",
    "posted_at": "2022-05-28 19:15:06.000000 UTC"
  },
  {
    "text": "Brasil, Perú, Argentina, Colombia, Ecuador, Venezuela, Bolívia, Uruguay, Paraguay",
    "title": "Está faltando el horario para Sudamérica",
    "posted_at": "2017-10-15 16:16:04.000000 UTC"
  },
  {
    "text": "Seria bom que que fossem aceitos cartoes de credito de todo o mudo para a assinatura de gravacao. Tenho interesse",
    "title": "Gravacao",
    "posted_at": "2019-12-28 02:09:45.000000 UTC"
  },
  {
    "text": "Useful but irritatingly slow to show any camera stream or recording even though Internet connection is very fast. Cameras also don’t pay attention to home / away and stay on even though my phone is present and on LAN. Smoke detectors are great. Much room for improvement overall.",
    "title": "Ponderous",
    "posted_at": "2022-09-21 08:03:40.000000 UTC"
  },
  {
    "text": "I have to be honest that I had really high hopes for the Nest product and it’s family of devices, but over time I have grown a little frustrated with its operation. I own a Nest thermostat and a Nest Protect, the thermostat is constantly resetting my manually set programs without making physical adjustments on my phone or at the thermostat itself, I am having to reprogram the Nest about once a month. I changed my internet provider last year and ever since my Protect has been offline, I have followed all the instructions to connect the project to the Nest, and keep getting an error message saying the Protect is too far from the Thermostat to connect, this message arrives as I am physically holding the Protect in hand while standing next to the Thermostat. I have deleted the device and tried adding it numerous times with the same failures. Beyond that the protect consumes batteries at an incredible clip, you would think that such a powerful company behind the. Eat products would be able to deliver an energy efficient product, but I guess that has yet to happen. Sadly, I am more disappointed than excited about how this product has functioned over the years.",
    "title": "Mixed feelings about the product",
    "posted_at": "2021-02-11 23:48:12.000000 UTC"
  },
  {
    "text": "The sound doesn’t work with Apple Airpods. Do you fix it?",
    "title": "Airpod sound",
    "posted_at": "2018-01-25 00:58:17.000000 UTC"
  },
  {
    "text": "In the familiar face section different profiles of the same face should really be able to added together as one person.\nIf I find more suggestions I’ll add to this.\nDevelopers please reply.",
    "title": "Awesome with a suggestion for developers",
    "posted_at": "2022-08-19 05:49:23.000000 UTC"
  },
  {
    "text": "Stop asking me to set up in Google. No thanks!!! Times 1000",
    "title": "Needs improvement",
    "posted_at": "2022-06-09 16:02:02.000000 UTC"
  },
  {
    "text": "I think this app is great, but I do think that it should work a bit better with Nest aware subscriptions. My sub trial when getting the cameras ran out. I wasn’t notified and didn’t know that you could not see playback of events of motion w/o it. I think that if your inside the app w/o one there could be a way to show a action of being able to set up a subscription via routed to browser just like the view account info does. In setting I think if they used inside the Nest aware tab maybe manage subscriptions, help, etc? Might be useful other than seeing what nest aware can do. Also there is a nest aware plus, I don’t believe it’s shown what’s the difference inside the app either which could be nice. These features I feel are important so having better usability would be appreciated! I had to go on the website nest on my laptop and that’s the only way I knew I didn’t have a subscription set up and was able to do it that way. — if you need a UX Designer, let me know! 👋🏼 KatharineAshley(dot)com 💖\nThank you, looking forward to any updates",
    "title": "Nest Aware",
    "posted_at": "2021-02-22 17:39:18.000000 UTC"
  },
  {
    "text": "I bought this thermostat at the same time I replaced my HVAC system a couple weeks ago, but I wish I'd gotten one sooner. I'm sure I've already saved money, because the learning function has already made it WAY easier to maintain a comfortable temperature, and I don't forget that I have the AC or heat on, and overshoot a comfortable temperature. I was really impressed how quickly it learned my habits, and began preempting my changes, so I find I'm quickly losing the habit of constantly thinking about the temperature, and I haven't found myself uncomfortable enough to be reminded since about day 2. It's really cool to be able to control it from my phone, but I find the more technical controls useful, and the data it records and aggregates is just as interesting and useful. I know this is supposed to be a review for the app, not the thermostat, but it's really just an aspect of the same product, so I believe it's relevant. It IS a solid, intuitive app, user friendly & well laid out, and it's an app for an undeniably great product.\nPricey, but absolutely worth it.",
    "title": "Great, intuitive, useful app for a great product (Nest thermostat).",
    "posted_at": "2021-04-26 05:29:02.000000 UTC"
  },
  {
    "text": "The app itself works well. There are periods of time through the year where I would just like to run the fan on my furnace without being in heating or cooling mode. The nest thermostat can run the fan by itself, but when doing so it must be in heating or cooling mode. In spring, I like to circulate cool air from the basement through the house. I also like to leave windows open for fresh air, and circulate that air too. There are days where it’s 80* during the day and 50* at night. These are perfect days to leave windows open and periodically run the fan. However, for this to work with the nest, I have to set the cooling mode on and use a cooling set point above 80* to make sure the air conditioning isn’t coming on wastefully while windows are open. It’s not the end of the world, but an item that I believe should be simple functionality that would bring me to like the product better. If it worked as I would like it to, I could check in on the temperature with the app and run the fan during the day, without having to mess around and closely monitor temperatures.",
    "title": "One small thing that makes a big difference to me",
    "posted_at": "2019-11-30 03:27:57.000000 UTC"
  },
  {
    "text": "Installed the Nest learning thermostat a few weeks ago. Installation instructions are clear and easy to follow so it was smooth and easy but that is where the easy ends. Setting it is simple but understanding how eco mode works was not clear and is actually nonsensical. If it senses movement it thinks you are home but if not it goes into eco mode. If your thermostat is in a room that you don’t walk past much it keeps going into eco mode which can bring the house down to a very low temperature unless you set that properly. It can also use your phone to know if you are home but guess what? You need to install and setup google home for that feature to work and everyone has to install it and join. If not, when you leave the house it goes back into eco mode! But, when I was home it thought I was out? Why? Could never figure that out. And the learning feature is just a waste of time. We ended up setting a schedule, turned off eco mode and change it for the occasional times we need to. If you want a thermostat you can adjust from your phone it does work well for that.",
    "title": "Works well but has some kinks",
    "posted_at": "2022-01-24 19:51:21.000000 UTC"
  },
  {
    "text": "Such a great camera.\nOnly problem is recommending service% tells me it is with another account holder. Unable to get any help. Just lucky it woke up and let me use recording again.\nNeed better help option and not go around in circles. A dedicated 24/7 phone line would ease frustration. Can’t really recommend until service options are better. Thanks.",
    "title": "Nest cam",
    "posted_at": "2022-04-15 15:07:02.000000 UTC"
  },
  {
    "text": "The fotos came very late",
    "title": "Maria adams",
    "posted_at": "2019-11-25 20:46:32.000000 UTC"
  },
  {
    "text": "Awesome doorbell. Australiame who is at the front door would be pretty cool but the App crashes after 17secs and logs me out everytime. It simply doesnt work and Nest wants to charge $70 per year for this!?!? I think NOT! I read many reviews to see if anybody else has the same problem and surely enough they do! When will Nest fix the issue, nobody knows but I can say that its been several months now and still no fix. Not happy at all!",
    "title": "Nest Hello",
    "posted_at": "2021-10-03 02:54:15.000000 UTC"
  },
  {
    "text": "ThIS REVIEW IS FOR THE APP\nBut seeing how you can't separate the device from the app, there is some crossover.\nIt was \"the first\" and it's been a consistent performer. I haven't looked into the EcoBee enough to know if it can perform a few things better but here goes.\nThe good is that it does learn and does keep track fairly well of what we like. But I feel the bad are so easy to change I just don't know why Google doesn't.\nI have a two story house, the front faces directly east towards sunshine. The Nest is in the shade on an upstairs wall and I have a Nest temperature sensor downstairs. Like most houses, my upstairs becomes a furnace while my downstairs is a freezer.\nThe first problem is that for scheduling which sensor I want the app to use, the times are not adjustable. Meaning for most of the day I want the downstairs sensor to keep the downstairs more comfortable as that's where we spend our time but we put the kids to bed upstairs at 8pm and the app won't let me switch to use the upstairs sensor until 9pm. Why does scheduling have to be in blocks that Nest forces?\nThe second problem is that setting the sensor to Away or back to Home when we leave for vacation never stays set. Twice now I've set the thermostat to turn back on because we are headed home only to realize the app changed back to Away once I closed it. We've resorted to keeping the app open or checking constantly to make sure the temp. gets back to normal.",
    "title": "If only...",
    "posted_at": "2020-04-02 14:18:00.000000 UTC"
  },
  {
    "text": "There’s a clash between Nest and Google Home when using phone to indicate your presence.\nJust which one you need to setup should be clarified because they don’t work together. Frustrating!!",
    "title": "Home presence",
    "posted_at": "2021-10-25 09:52:56.000000 UTC"
  },
  {
    "text": "We have had Nest for about 5 years now!\nFind it great to check on our home and dog while we are away from the house!\nI can even check when I’m overseas !\nThanks",
    "title": "Great security",
    "posted_at": "2019-11-23 06:48:33.000000 UTC"
  },
  {
    "text": "It does what it dose to do. I can see all of my cameras altogether without too much lag.\nIt is a slow app, but faster than Google Home.",
    "title": "Much better than Google Home",
    "posted_at": "2022-01-14 08:20:58.000000 UTC"
  },
  {
    "text": "Please allow the app to run as a small window on your device so you can do other things while watching the camera.",
    "title": "So much better than the google app",
    "posted_at": "2020-12-14 01:00:34.000000 UTC"
  },
  {
    "text": "Doesn't support countries from South America",
    "title": "Other Countries",
    "posted_at": "2016-07-28 18:04:08.000000 UTC"
  },
  {
    "text": "Wheres brasil time???",
    "title": "Brasil???",
    "posted_at": "2014-11-18 23:20:55.000000 UTC"
  },
  {
    "text": "Still not reliable. The camera goes offline for no apparent reason and usually doesn’t reset unless you turn the device off and on. Not very helpful when you are away from the device.",
    "title": "Good but keeps going offline",
    "posted_at": "2021-02-05 11:07:38.000000 UTC"
  },
  {
    "text": "Never used to happen but now it just crashes after a few seconds.",
    "title": "App keeps crashing",
    "posted_at": "2020-06-21 02:15:10.000000 UTC"
  },
  {
    "text": "Excelente App gostaria que tivesse a compatibilidade com as câmeras bateria do Google Home\nEstás câmeras bateria só abre no aplicativo Google Home que é um App muito pesado pra abrir e limitado .",
    "title": "Nest cam",
    "posted_at": "2022-09-18 12:04:42.000000 UTC"
  },
  {
    "text": "Não sei o que vcs tão falando pq funciona sim no Brasil no Brasil e outro lugar pq eu tenho na minha casa de Orlando e aqui e quando estou viajando falo com meus gatos e perfeito",
    "title": "FUNCIONA NO BRASIL",
    "posted_at": "2020-12-25 15:28:53.000000 UTC"
  },
  {
    "text": "Replaced our thermostat with a Nest thermostat in our holiday home and it is an absolute winner! Love being able to precisely control the temperature when we are not there, before we arrive etc and knowing for sure it hasn’t been accidentally left on unnecessarily. Huge money and energy saver and so easy to use - love it!!",
    "title": "Brilliant - a huge improvement",
    "posted_at": "2021-05-08 23:39:27.000000 UTC"
  },
  {
    "text": "I live in Brazil. I can’t insert my city or ZIP code or Time zone.",
    "title": "Don’t suport South America",
    "posted_at": "2018-01-06 18:16:49.000000 UTC"
  },
  {
    "text": "Bought 2 of these (battery model). Very easy to set up and install. I used a google nest video on good guys website where I bought these. I was disappointed initially that the build date on these was over 2 years ago so 1/5 of appliance life has already gone (only identifiable once box was opened). Good guys were very good and gave proportionate refund which I was happy with. Installation on wall was very simple.",
    "title": "Looking good and working well",
    "posted_at": "2020-03-13 06:37:01.000000 UTC"
  },
  {
    "text": "BE AWARE: 5 STARS TO COME UP IN THE REVIEWS BUT IT IS A 1 STAR SITUATION AT THE MOMENT! I love my nest camera, I have 5 of them with 2 being linked through Google Home app. My Nest Doorbell, Nest Thermostat and indoor cameras are pre Google Home era so I don’t get full control unless I use the Nest App. I had no problem with this since I knew Google bought Nest but since getting the two newest cameras my Nest App has been crashing like crazy. Every time I access the app, it DOES NOT LOAD! It forces me to re-sign in 5-6x every time and when it lets me in, it doesn’t show me the live feed unless I restart the app. I don’t know if this is Googles way of telling us to move away from Nest App but if it is, GOOGLE YOU ARE CRAZY!! I’ve spent over $1,000 with the 3 cameras and thermostat so to just boot people and not give full feed access on Google Home app is UNACCEPTABLE! Either update Nest App and properly manage it for the sake of the people that spent thousands of dollars before you bought NEST or give us full feed control on your Google Home App! I am beyond mad at this point!",
    "title": "NO LONGER USABLE!",
    "posted_at": "2022-05-12 21:59:23.000000 UTC"
  },
  {
    "text": "Something is going on with Nest Cam. Not as good as it used to be. Buffering often. I have Gig Fiber service and 4 Nest Cams. Lately Nest Cam keeps dropping out log in on the App. Several times I had a motion event then I quickly went to open App to view. Well it required I go through the cumbersome Google login procedure Again then security log in alert emails start after log in. This been happening more often recently. Also it’s been missing more events even when there has been no activity for hours. For example Nest Cam never alerted me of a postal delivery right in from of cam. This particular cam location is not in an area with much activity. I could scroll back and find delivery but this is cumbersome. In real-time cam view activity is lagging more than it used too. Used to be just seconds behind activity. Now running minutes. Had Nest Cams since 2014 and find the service slowly degrading since Google acquisition of Nest. Time to move on to other systems.\nSpinning circles go round and round and round.\nOur internet speed is unlimited and giga.",
    "title": "Nest Cam Slow, Misses Events, needs App log in More Often",
    "posted_at": "2022-05-03 21:34:29.000000 UTC"
  },
  {
    "text": "I’m a self employed contractor for a well known satellite company. It might rhyme with fish, who knows. I install and teach all Nest products for customers wishing to purchase them. Also, these products are absolutely amazing and top notch. I highly recommend them for anybody, but sometimes I run into a problem. Let’s say I install the doorbell and google home hub to the husband’s phone. If I send a home invite from husband’s phone to wife’s phone and accept, the wife’s phone won’t have access to the doorbell and only the home hub. Sometimes it’s neither, but mostly just not the doorbell. I make sure that the couple are using gmail accounts. Google assistant is also installed. When this happens the only way to “fix” this is to use the husband’s email on both phones. Surely I’m just missing something here and this only happens to me. Other than that keep rolling out newer products and models! This stuff is next level smart home experience!",
    "title": "Operator difficulty",
    "posted_at": "2020-03-11 01:54:01.000000 UTC"
  },
  {
    "text": "I subscribed to nest but wanted to change it to another location. I wasn’t able to figure out how to do this without cancelling and resubscribing",
    "title": "Love but it needs some work",
    "posted_at": "2021-12-07 20:55:29.000000 UTC"
  },
  {
    "text": "We’ve had the Nest for about 6 months now, and while I don’t know if it’s saving us any money by using, it is so nice to be able to set it to a specific temperature vs. the old thermostat which had the little slide lever on the bottom, and you slide it to the right for a higher temp or to the left for a lower temp, but there was no indication as to what actual temp you were sliding it on to.\nI also love that I can control the Nest from my phone. If I’m in bed and want the temp moved up or down you grab your phone and change it. That said you can also program it to be a certain temp at a certain time of day. This is great in the winter time, when everyone is out of the house at school or work, and want the house warmed a bit by the time everyone gets home.\nWhile we haven’t yet gotten into the full swing of summer, I highly recommend the Nest. Its easy to use and makes controlling the temps in your home a breeze.",
    "title": "So far, so good",
    "posted_at": "2020-05-27 17:27:46.000000 UTC"
  },
  {
    "text": "Não consigo ligar minha câmera Nest (sala)no meu celular",
    "title": "Dificuldade sinal / acesso à câmara de outro cômodo da casa - da sala",
    "posted_at": "2022-02-11 13:43:55.000000 UTC"
  },
  {
    "text": "Muito bom para quem viaja. Imagem excelente.👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻👏🏻🇧🇷",
    "title": "Excelente aplicativo.",
    "posted_at": "2021-08-24 14:44:53.000000 UTC"
  },
  {
    "text": "I’ve had Honeywell internet-compatible thermostats in my house for nearly six years, and they just stopped communicating with the internet after multiple calls with service. Luckily I got them at Costco! Costco returned them with no issues, and they also happened to have Nest thermostats available too. So I got a full refund for the old thermostats, and bought two new Nest Version 3 thermostats (as my house is divided into two areas). Replacing the first thermostat took a little longer than the second, as it was just getting to know how the unit works and confirming the wire schematic. The first unit connected to my router with no problems, but the second one kept failing at first. I ended up temporarily moving the second unit to the first unit’s location and got it to connect. After I moved it back to its correct location, it was still connecting ok.\nThe only reason I gave it 4 out of 5 stars was that the actual application kept disconnecting after both thermostats were connected, and several times during installation. It’s almost like it reset, and you’d have to start the install from the beginning again with the Nest app.",
    "title": "Replacement Thermostats",
    "posted_at": "2020-04-17 18:53:04.000000 UTC"
  },
  {
    "text": "i have had my nest cameras for about a year & a half and i would recommend them to anyone! the quality of both the video & audio is still amazing to me.\ni bought the cameras after having a recurring issue with a neighbor & their teenagers. it was not long before the cameras put an end to the ongoing issue. the teens were in rare form one day, yelling obsenities & making crude gestures. then they called their mom & said i was harrassing them. when she got home i walked across the street with my cell phone. both cameras caught the entire episode. at one point the teens were out of view of the cameras, but the AUDIO was still captured of them threatening to destroy my cameras.\ni have not had an issue since then. the cameras were a lifesaver!\non another occasion, my mailbox had been hit, so i just scrolled back through the video & there it was. a landscaping truck had taken it out. i simply called the company, forwarded the video & they replaced my mailbox.\ni am a single woman, so the cameras give me peace of mind. they have paid for themselves many times over!",
    "title": "Love My Nest Cameras",
    "posted_at": "2019-12-28 15:48:25.000000 UTC"
  },
  {
    "text": "The nest is second to none. I have replaced three electronic thermostats and was hesitant to purchase the unit for couple reasons. I have Alexa units through out the house. The cost compared to other units. My only regret I should have bought it earlier. It’s easy to install and use. The Mobil app is so convenient. If your laying in bed you can adjust the temperature from your phone. If your away from your home you can monitor and change any setting remote. Ladies turned the heat up or air conditioning down no problem Mobil app! The features are amazing it’s a well thought out product. The unit view awakes when you look to see what the temp is.. Only negative about nest is if you have google workspace you have to create another email outside of workspace. The google nest product does not connect to google nest thermostat. That’s a very small one time inconvenience for the most sophisticated easy to use thermostats I have used as a home owner of over 30 years! On the fence but it! You won’t be disappointed but amazed with the quality and convenience of the unit.",
    "title": "On The Fence because of Price of Unit",
    "posted_at": "2021-10-17 09:26:11.000000 UTC"
  },
  {
    "text": "The subscription ended and now can’t renew anywhere as tried every avenue but it doesn’t load or redirects to blank file .\nNow I only get photos which are stored for a few hours ,would not recommend as no support",
    "title": "Tony",
    "posted_at": "2021-03-30 04:48:11.000000 UTC"
  },
  {
    "text": "I loved my Nest camera when I first bought it. I loved the “home/away” features to turn on/off automatically. I loved that I could have a schedule to turn the camera on at night regardless of whether I was home or away. Then, Google took over... the beginning of the collapse. Ever since Google Home took over, my camera’s home/away features are awful. My schedule doesn’t work because I’m home. If I turn the home/away feature off, the schedule would work, but even that stopped. I had to stop using my phone location services for the camera to work.... and now I have to physically go into the app and manually turn the switch on. The camera will even turn on or off on its own. There are times when I am home, and I know I turned the camera off, but I get notifications that someone is in my home, and the camera is on!!! Scary! The camera turns off on its own. I make sure to turn it on before we leave, but I check it a few minutes later, and it’s off!! Someone please help... I may have to find an alternate product. Nest is awful since Google took it over. Thanks, a lot Google.",
    "title": "Google made it too buggy",
    "posted_at": "2020-10-04 00:40:06.000000 UTC"
  },
  {
    "text": "Pros:\n-well built.\n-easy to install\n-built in lithium ion battery backup\n-Geofencing.\n-runs fan after the heat turns off for a couple minutes to get the rest of the heat out of the ductwork instead of heating the walls.\n-seems to connect well on both 2.4 and 5 G networks.\n- the app does well at showing the thermostat wire connections.\nCons\n-does not work with Apple home kit which would put the Thermostat control right in the control center of the iPhone. I am hoping they add this in a future update!\n-no geofencing range limit that can be set. Not sure what range it is using. It would be great to at least know.\n-requires all home members who want to use geofencing (home/away) feature to have separate google accounts.\n-does seem to always recognize when I come home and doesn’t switch from Away to Home mode.\n-cannot set the cycle rate so the temps fluctuate way to much. I am guessing the different is about 2 or 3 degrees. This maintenance band is too wide.\n-both on the app and the thermostat it’s hard to know what temperatures you are looking at, is it the actual temperature or set point. Especially around the dial, it just uses points and does not list out the actual temperature. Very annoying. I don’t want to have to add up 1/2 degree tick marks. Include some numbers already.\n-lithium ion battery is probably not replaceable.\nWas a tough choice between this and the Emerson Sensi. Just hoping for some good updates now that google owns it.",
    "title": "Nest Thermostat App",
    "posted_at": "2019-12-21 22:06:53.000000 UTC"
  },
  {
    "text": "I’ve had the nest thermostat for almost a year now, and I can say it’s money well spent. First, it was very easy to install. The instructions are easy to follow; I did not have to do any rework. I did not have to hire a professional. Programming the controls was also easy with step by step instructions. I like the fact that it self programs economic settings based on when you’re home. I’m single and working so it’s nice to know it is saving me money by reducing back the heating and cooling temps when I’m not home. And it does it automatically through a sensor that detects motion. This could, however, be a problem if you have a big dog. You can also control the settings using your smart phone, which is what I do pretty much all the time. I can even control it from work and by using Google voice. This system requires a dependable WiFi. If the WiFi goes off line, however, as it has done with me a few times, the system will still function but you won’t be able to control it from you smart phone. Once the WiFi is back on line, the thermostat will automatically resume previous settings. And best of all, it has saved me hundreds of dollars in utility savings. And it looks sharp on the wall. Well worth the money, and so easy for DIY’ers. Definitely worth a five-state rating!!",
    "title": "Outstanding system",
    "posted_at": "2021-10-23 12:20:31.000000 UTC"
  },
  {
    "text": "This is a god quality camera and app. It always connects no problem - unlike many others and this no name brand cameras that have SO much difficulty connecting. This is the best of the bunch.",
    "title": "Excellent camera and app",
    "posted_at": "2022-02-04 05:08:56.000000 UTC"
  },
  {
    "text": "This is a great addition to the home, just had my first alarm go off letting me know I had something burning on the stove and smoke had filling the kitchen while I was in the lounge room, the detector there let me know which room had smoke. Highly recommended",
    "title": "Google nest smoke and carbon monoxide detector",
    "posted_at": "2020-11-25 08:58:31.000000 UTC"
  },
  {
    "text": "So handy to be able to control the heater remotely. For instance, after being away for a few weeks, rather than returning to a cold home and bed, I simply switch the heating back on the day before from anywhere in the world and presto, the house is back to living temperature upon return.",
    "title": "Love it !",
    "posted_at": "2022-09-05 23:28:57.000000 UTC"
  },
  {
    "text": "Great app and very helpful devices. Definitely worth installing.",
    "title": "Nest cameras",
    "posted_at": "2022-09-30 10:36:40.000000 UTC"
  },
  {
    "text": "You never know how valuable something is (or if it even works!) until you *have* to. For us, that experience was with our Nest Fire and CO2 detector. When we needed to replace old detectors, I chose to pay a little more for Nest. Would it pay off; would it be worth it? We figured probably not, but we installed them anyway.\nThis holiday season, we were 900 miles away - certainly not thinking of home. At church, I went to silence my phone & noticed a Nest alert that there was smoke detected in our home. Surprisingly calm, I called our local fire dispatch & contacted neighbors and family. By the time the fire department arrived, smoke filled our home. The cause: an overheated furnace!\nOur home was likely saved because of that Nest alert. We can deal with minor smoke damage! That decision to buy a Nest product made all the difference in the world. It worked exactly as expected, when needed most, and we are forever grateful.",
    "title": "Literally a Life Saver",
    "posted_at": "2019-12-29 16:48:37.000000 UTC"
  },
  {
    "text": "I’m an AC service tech and thought I’d write a little bit on my first NEST thermostat installed a few weeks ago. I was a little hesitant to replace my perfectly good Pro9000 but, so far, I’m extremely pleased and a little impressed! I’ve owned various Honeywell stats (which were all great btw) but with more customers purchasing or requesting NEST stats, I decided to try one and learn the features better so I can better assist customers when asked about them. Being in the HVAC field, what makes me really like this NEST stat (besides it’s super sexy design) is it’s available features like farsight, optional eco settings, and it’s overall ease of use. The NEST is not a touchscreen stat but it’s easier to navigate than my Honeywell Pro9000! Also, if you have Google assistant and other google home products it’s the stat to have as it’s super easy to set up and performs great. Looking forward to seeing how it holds up.",
    "title": "Ver nice thermostat!",
    "posted_at": "2021-04-16 01:14:58.000000 UTC"
  },
  {
    "text": "I definitely recommend the app!The app does some of what you’d think, but coming from Google it’s weak. I think it could be much better. 1) It should show what you can see on the thermometer itself: inside temp & humidity as well as outside weather 2) Setting an initial schedule is horrendous. You can’t copy & paste rows. So sad especially given that Google owns google docs. I mean c’mon! Get your act together. 3) The reporting is also weak. My first report after having the app for a month said I hadn’t used any energy (in July with central a/c).Wait what?! 4) Speaking of, since it connects directly to my electricity provider it should be able to give real time stats on usage. Kinda a no-brainer. 5) Is google just making this a weak app because it’s for iOS? Anyway, to make a long story longer...make it better, Google. Show us you can do better, please.",
    "title": "Great — love the app and Nest thermostat",
    "posted_at": "2021-08-19 01:51:18.000000 UTC"
  },
  {
    "text": "Easy tô install! Works really good",
    "title": "Good",
    "posted_at": "2016-10-01 12:46:37.000000 UTC"
  },
  {
    "text": "My 80 year old mother lived by herself and started falling. One day after several people tried contacting her by phone, I went to check on her and found her laying on her bathroom floor. Upon paramedics arrival they estimated she had been on the floor for a couple of hours due to dry blood from where she hit her head due to a fall.\nThat’s when Nest cameras came into our lives !!!\nI needed something I could check on her without drilling into apartment walls that was not allowed. My brother suggested and came and set up 2 camera’s. One in her living room and one in her bedroom.\nMy mom has Alzheimer’s and Dementia and has lived with 2 alternating caregivers for almost 3years now.\nI can keep a close eye on her, I have been able to assist the caregivers in time of need and my moms confusion by talking to my mom through the cameras and I cannot stress how these cameras has tremendously and so outstanding has helped to keep my mother home and safe and has been absolutely a BLESSING TO HAVE!!",
    "title": "A Life Saver!!",
    "posted_at": "2019-11-09 20:13:15.000000 UTC"
  },
  {
    "text": "I’ve had this Nest thermostat just over 6 years & it is by far the best thermostat I’ve ever had! First of all it’s extremely reliable! However the best part is the savings & comfort that comes with it! The temperature goes to whatever “away temp” on its own automatically when everyone leaves our home & then goes back to my normal setting when you walk in the door. I can also go to the Nest app on my way home & set the temp of my choice if I want to! It also learns the temps we like at certain times throughout the day if I want it to do so. I also think it’s cool that the thermostat screen is blank until I walk up to it & then it comes to life. I’ve recommended this thermostat to many people & absolutely everyone that has took my advice & bought it loves it just as much as I do! I have the first generation so I can only imagine that it has gotten better which is hard for me to believe. All I can say is buy one! I promise that you will love it too!",
    "title": "Nest T-stat is awesome!",
    "posted_at": "2019-12-25 00:29:46.000000 UTC"
  },
  {
    "text": "So easy to set up. And sends you alerts which for us we use it for our birthing pups. So we can be anywhere and know what’s going on back home.",
    "title": "Great camera",
    "posted_at": "2021-12-23 13:15:36.000000 UTC"
  },
  {
    "text": "Simple and fast! Good choice!",
    "title": "It really takes just a minute!",
    "posted_at": "2015-12-16 02:56:59.000000 UTC"
  },
  {
    "text": "Love my best I would have purchased for the night light feature alone. 😍",
    "title": "Super impressed",
    "posted_at": "2020-11-04 11:35:44.000000 UTC"
  },
  {
    "text": "O aplicativo anterior Dropcam você conseguia compartilhar com outros membros da família. Comprei a última versão da câmera, não posso mais usar no aplicativo anterior e o novo, Nest não consigo compartilhar e nem ver as câmeras públicas!!!! Pena, porque o hardware, a câmera é excelente e sempre indiquei!",
    "title": "Infelizmente retrocederam",
    "posted_at": "2015-10-27 20:08:48.000000 UTC"
  },
  {
    "text": "O app funcionava muito até atualizar o iPhone para o iOS12. Agora ele não abre mais, fica em loop e não abre. Teremos correção?",
    "title": "O App deixou de funcionar iOS12",
    "posted_at": "2018-09-27 21:00:04.000000 UTC"
  },
  {
    "text": "I currently have nest cameras as well as Ring and Arlo. By leaps and bounds the Nest cameras are better.\nPros:\n1: The picture quality and reliability\n2: The night vision is far better\n3: the recording time is longer thus capturing more of any event\nCons:\nThe only complaint is the newer version no longer works with the nest app and require Google Home app which is frustrating having to switch between when trying to rush for another angle or view.\nRing Cameras:\nThe only Ring camera I’m ok with is the doorbell camera simply because it’s covered and does not get condensation on it allowing for a continuous clear view.\nThe others get condensation and or ice on them and the picture quality is worthless.\nArlo Cameras:\nThe Arlo cameras hold only advantage for me at my location and that is Wi-Fi range from the home. Meaning I can place them further up the driveway for advance warning.\nWhile the Arlo cameras also get condensation on them they are still an improvement over the Ring Cameras.\nHowever the record time is so short you may miss way to much of the event.\nAll in all I highly recommend this Nest Cameras as I’ve had little to no issues with them. As time progresses and funding is right I fully intended to replace the Ring Cameras with Nest.\nI sincerely hope this help’s because it’s my honest review and I am not being paid to do so lol",
    "title": "Nest Cameras",
    "posted_at": "2022-09-18 03:02:14.000000 UTC"
  },
  {
    "text": "We have a large home with 12 smoke alarms. We have had issues for 4 years with the standard smoke detectors going off randomly all at once with humidity and other times where they went off all at once for no apparent reasons. The fire department had to come out 3 times and our electrician came out several times to try and troubleshoot the problem. We narrowed it down to the smoke alarms.\nI knew I needed a very high quality and intelligent smoke alarm that could isolate which smoke alarm had the issue. I also wanted to have access to know if the smoke alarm was functioning properly. Nest Home Protect had all of the technology we needed and we just installed all 12 yesterday and we love how they operate. It was an expensive option but well worth the peace of mind knowing we do t ha e to listen to the chirps and guess which alarm needs a battery. I would highly recommend this to anyone!",
    "title": "Resolved our problems",
    "posted_at": "2021-07-08 14:18:36.000000 UTC"
  },
  {
    "text": "I set my auto schedule to run all week at 72 during the day and 70 at night and my thermostat keeps running the A/C at 69 F even when I’m not home and I’ve set my auto schedule thermostat manually and on this app multiple times to run at 72 during the day and 70 overnight and my A/C just keeps running continuously during the day when I’m not even home. I keep setting it at 70-72 and it just changes the A/C to run at 69. Then I wake up covered in sweat overnight because it’s not running at all. What’s the point of setting auto schedule or even manually adjusting the thermostat when it just runs whenever it wants to at the temp it’s not supposed to be running at? My utility bill is gonna be SO high because the system is overriding any manual or automatic setting. Anyway to fix this? I have a friend who’s gonna come look at the unit but I’m scared for what my bill is going to look like.",
    "title": "Auto Schedule",
    "posted_at": "2020-09-13 04:05:17.000000 UTC"
  },
  {
    "text": "Very good!!",
    "title": "Wandrful",
    "posted_at": "2017-05-26 10:04:57.000000 UTC"
  },
  {
    "text": "I bought my nest almost a year ago and have loved love it so much that I bought one as a gift for my brother. It is such a neat peace of tech but that isn’t even the best part. The best part is the customer service you get if anything goes wrong. My nest stopped working, just one of those things right as temps started to get hot. I called their tech support and all I can say is WOW!! They’re so worth every penny and more I spent on that nest. The tech Noelia stayed on the phone with me until she got my AC working temporarily and she is rushing me out a new unit. It was easy to get my AC working again and she walked me through it step by step and waiting on the line to make sure we had air. They not only have super cool gadgets to make your home convenient and efficient but they have AMAZING representatives to help you with everything you need and I didn’t have to call India. Lol. I LOVE LOVE this company and my nest learning thermostat. Thank you guys.",
    "title": "Amazing customer service!!!",
    "posted_at": "2020-04-24 02:07:27.000000 UTC"
  },
  {
    "text": "I have experienced the same ongoing issues as others with the lack of proper home/away assist sensing based on my phone location. Maybe 5% of the time this feature works correctly since iOS 15 arrived. Typically I have to open the Nest app once I know my status has changed and wait about 15 seconds for the app to ‘catch up’ with my phone location and change status. (Seems kind of counterintuitive for an app handling automation/convenience). Other times even this doesn’t work and I have to manually switch the home/away status. A darned shame the Google has forced me to become their customer by purchasing Nest and then dropped the ball in providing me a useful product despite the very positive experience that actually dealing with Nest was.\nAt this point my plan if Google has indeed stopped support for the actual Nest app and the 1st gen cameras are not fully supported by the Google Home app is to remove my previously loved Nest products (cameras, thermostat, smoke/CO detector) and replace them all with competitors products. Google likely doesn’t care…but I do and am confident I deserve better service than I am currently experiencing.",
    "title": "Seriously Broken Since iOS 15 Arrived",
    "posted_at": "2022-02-04 00:59:36.000000 UTC"
  },
  {
    "text": "Camera worked great for a week but after that the app kept having issues. It won’t record most of the time and the clips that it does record won’t play. I used to be able to view a clip from the day and watch the playback but now it won’t play anymore.. it’s just a photo which is so useless. For something worth $230 I would expect it to work.. it won’t even do the bare minimum of what it supposed to.. useless product and app. Never buying nest cameras again",
    "title": "Worst app ever",
    "posted_at": "2021-06-24 02:15:31.000000 UTC"
  },
  {
    "text": "We have had Nest products for years (cameras, thermostats, and smoke detectors) and although we were really happy with them at first, they have just been getting worse and worse over the years. Connectivity issues on the devices themselves (both newer and older devices) and connectivity/playback issues in the app no matter what router/cell coverage and internet speeds we have. Often the skip forward/back 15 seconds takes longer than 15 seconds to even load, so often it is useless to try to skip forward. No real useful updates or improvements made to the app in who knows how long (how about a pause playback button or better clip making features both of which are available just through web browsers?!). I know Google has been known to drive products/services they purchase into the ground but was hoping maybe Nest would be the exception since they seemed to be pretty hands-off for a long time. Seeing as how Nest has been on the decline for a while now though, recently rebranded as “Google Nest”, and Google has all but forced Nest logins to merge with Google logins, I suppose we are in the market for other products at this point...",
    "title": "Nest has been on the decline for years. Thanks google",
    "posted_at": "2020-02-25 01:43:07.000000 UTC"
  },
  {
    "text": "Purchased a nest protect unit to work with my google home and google nest pro. I found the nest app does not talk to the google home . I was hoping I would get notifications from my nest protect to my google speakers so I would be notified if there was issues or a fire in the other part of the house. This is not the case. I have spent a few hours trying to connect the two apps / logins together. This is very poor given the price point of the physical equipment",
    "title": "Does not play nice with google home",
    "posted_at": "2021-03-23 00:22:54.000000 UTC"
  },
  {
    "text": "The nest app used to be great and worked seamlessly. Somehow Nest consistently releases bugs and the app gets worse every time I use it. At this point scrubbing through video streams is completely unusable. It glitches and jumps and freezes so much while trying to scrub that it becomes so irritating that I just give up. What’s strange is that it used to work just fine, some how they totally messed it up. Not only that but they actually accidentally removed the button to be able to switch between events and the ability to scrub through the video feed. The button was still there just didn’t have an icon so you could still activate it for a while. Overall I’ve become so consistently disappointed with nest and their app that I’m slowly getting rid of all of my nest equipment. For the record, I have four nest cameras, a doorbell, thermostat, the security system and two smoke detectors. I also pay for the subscription monthly.\nI also understand it might be hard having employees work from home and that updates might be tough but honestly it’s almost as if there is no quality assurance whatsoever. I work in software engineering and if I released the garbage that nest releases I might get away with it once but on a consistent basis, like nest, I would totally be fired.",
    "title": "Consistently worse every time I use it",
    "posted_at": "2020-11-28 19:13:53.000000 UTC"
  },
  {
    "text": "Comprei um detetor de fumaça Nest Protect. Simplesmente não consigo configurá-lo. Fiz tudo e mais do que é recomendado pelos canais de suporte da Nest. Simplesmente não consigo configurá-lo. Umas as coisas esquisitas é a exigência de habilitar IPv6 no roteador ... quantas pessoas conseguem fazer isso?!?!? Sou profissional de TI, consigo fazê-lo, mas simplesmente não funciona. Aliás, os problemas que já tive com os equipamentos Google me fizeram simplesmente desistir de usá-los como interface de automação residencial. Fui obrigado a comprar um roteador novo porque o Google mini e Google Nest não conseguiam se conectar à minha rede Wi-Fi nem com reza. O suporte de nada adiantou - nem uma “white list” nem uma “black list” eles tem! Troquei o roteador baseado na minha experiência - mas mesmo assim foi arriscado. Com o novo funcionou. Por sorte. Um conselho: fiquem longe de Nest, Google Assistant, mini, etc. Alexa e seus dispositivos são muiiiito mais fáceis de confgurar/usar - e isso sem contar que a voz do Google Assistant é irritante ... A voz de Alexa chega quase a ser sexy !",
    "title": "Suporte inacreditavelmente inútil",
    "posted_at": "2020-03-28 02:17:08.000000 UTC"
  },
  {
    "text": "As with just about all of my nest products I’m mortified at how horrible this app performs. I’m so invested with nest at this point I feel stuck after buying a massive bundle package a year or so ago. They’re app crashes constantly and takes forever to load anything. They’re notifications would rather focus on shadows and bugs then the mail man or cars in my driveway. Their previews never load and instead I get a blank screen. While using the app or in between opening the app I am constantly logged out as is my wife on her phone. The quality of my WiFi doesn’t seem to matter but cameras are co stay my offline. The smoke detectors are constantly giving false smoke detections giving me a heart attack. They’re support is horrible and says use the google home app. Well that apps worse as you can’t open the app and see your cameras. You have to click on every camera to see it and it loads just as slowly and horribly as the nest app. I’m about to just throw it all in the trash and drop a bunch of money on a better product. You’d think a massive company like google would be on top of their tech and have something as sought after as this preforming like the public would expect it to do. So yourself a favor and look into other security options.",
    "title": "Horrible from start to finish",
    "posted_at": "2020-11-01 17:00:10.000000 UTC"
  },
  {
    "text": "É muito decepcionante ver uma empresa como a Google fazer tão pouco caso um um problema crônico em seus sistemas , como tem feito com as câmeras Nest. Tenho um conjunto de 4 , compradas ainda quando eram Dropcam. O Serviço era perfeito , atualmente não consigo praticamente utilizar , no app a imagem não atualiza , fica um eterno círculo azul levando as vezes minutos. No browser do IPhone não funciona e olha que estou utilizando o IPhone 10Xs completamente atualizado. Fujam dessa solução . Uma pena . Se alguém da GOogle estiver preocupado com a experiência do cliente , favor melhor o serviço prestado para as câmeras Nest.",
    "title": "Imprestavel",
    "posted_at": "2019-06-19 16:24:58.000000 UTC"
  },
  {
    "text": "This is my 3rd review on the same issue in nearly 12 months.\nThis will not work on any of my 4 apple products, IPhone X and 3 iPads, 2 of which are running iOS 14 plus. Sure, I have a picture for 10 seconds then it crashes telling me to try again.\nI am very disappointed with this issue as it has not been fixed.\nDon’t advertise that it works with apple. It does work on my old Samsung S5 through the google play store app.\nLuckily I only purchased one nest camera 2 years ago. Read reviews before purchasing a product.",
    "title": "Will not be buying a nest product again.",
    "posted_at": "2020-10-07 09:55:10.000000 UTC"
  },
  {
    "text": "Just DONT. Get a NEST CAM.\nSimple problem. You have google home to bring things together. This app is designed to not do that and the products that require it sit outside of Google Home. Then if it a camera they require a subscription for it to be of any use.\nGet a Ring Cam, or Arlo, DO NOT use a Nest Cam. Just dont. Unless you only use the Nest app or a gmail only account. Like to pay extra.\nNest and Home, once combined with an integrated storage plan and no limitation on the type of google account you have will be great. Until that point (and its completely unclear on packaging and in manuals) just dont. If its certified to work with any (workplace or gmail) account then thumbs up.",
    "title": "No way these products rate above 2",
    "posted_at": "2021-08-28 15:48:35.000000 UTC"
  },
  {
    "text": "I’m a new user of the Nest Thermostats and like the equipment so far. My issues is with their remote services, in particular, their requirement to migrate my account to my gmail so I can use their smart services. In order to do that, Nest wants to have access to my google home names and the names and emails of my google home members. Why do they need this information? When I asked this question of Nest support, the employee didn’t have an answer. I refused to allow Nest access to my private and personal information and, in return, Nest denied me access to their smart services. In a nutshell, I now have a very expensive manual thermostat with no accessible smart features! I cannot use my thermostats remotely, and the sensors are completely useless because I can’t access them unless I migrate my account to google sign-in.\nThere is one workaround: create a bogus gmail account and use that only for Nest app. So I did that, because let’s face it, I got a smart thermostat so I didn’t have to get out of bed at 3 am to adjust the thermostat! Worked fine for a day but now my account is offline and the Nest solution is to restart my router and disrupt all the other services and devices on my router so Nest can find my wifi signal again!",
    "title": "Must migrate to Google to use the app!",
    "posted_at": "2019-12-10 19:51:38.000000 UTC"
  },
  {
    "text": "Doesn’t support Brazil",
    "title": "Brazil - Support",
    "posted_at": "2021-05-26 12:49:10.000000 UTC"
  },
  {
    "text": "This is one of the stupidest ideas ever. Unless you are always moving around in front of your thermostat, it can’t learn when you’re at home so you have to turn off the auto adjust. Then, even with all the smart settings off and just setting a schedule, often it will just leave the heater on even when scheduled to be off or off when scheduled to be on. Save yourself the trouble and just get a cheap ‘dumb’ thermostat from eBay.",
    "title": "Un-smart thermostat",
    "posted_at": "2022-09-07 14:00:55.000000 UTC"
  },
  {
    "text": "Não deixa Informar endereço do Brasil. Não está assumindo o fuso horário do Brasil e também temperatura em graus celsius",
    "title": "Brasil?",
    "posted_at": "2018-10-19 00:37:19.000000 UTC"
  },
  {
    "text": "Why can’t I set my Nest to a constant temperature and it just STAY THERE?! I don’t want to have to set up a schedule. I just want it to stay at the temperature I set it to and forget it! Here I am sitting in my home office, and all of a sudden I feel it getting really hot. I look at my app and it’s 77° in the house and the Nest thinks I’m “away”, when in actuality I just haven’t walked past the thermostat in a while so that it knows I’m here. Our house is 4,700 sq ft, and we just have the one unit, so hours can go by before I’ll walk anywhere close to the Nest device!\nAnother example: We set it to 72° the other day when it was hot outside and left the house for several hours. We come home and it’s almost 80° in the house, again because it “thinks” we’re away and shuts itself off! It was almost 3 hours before it felt cool in the house again. NOT gonna work for me… If I set my thermostat at a desired temp and I come home and it’s not that temp, that device is malfunctioning. And no - it’s NOT the AC unit. It’s all the Nest and it’s “smartness”.\nIf someone can’t tell me how to set it at a constant temperature and it keep maintaining that temperature indefinitely until I tell it to do something else, I’m ripping it out of the wall and back to the store it goes for a refund.",
    "title": "Constant Temperature Setting",
    "posted_at": "2022-06-01 21:44:01.000000 UTC"
  },
  {
    "text": "App not working to log in for about 3 days",
    "title": "App isn’t working to log in",
    "posted_at": "2020-08-18 14:11:04.000000 UTC"
  },
  {
    "text": "Não consigo inserir um endereço no Brasil. Não há a opção South America!!!!!!",
    "title": "Absurdo!",
    "posted_at": "2020-05-24 14:45:48.000000 UTC"
  },
  {
    "text": "South America countries are not listed under the region section. Can’t add right location under address. The app needs an update </3",
    "title": "No way!!! South America region is not on the app.",
    "posted_at": "2022-05-16 19:45:14.000000 UTC"
  },
  {
    "text": "O aplicativo esta horrível. Todo tempo saindo do ar.",
    "title": "Está péssimo",
    "posted_at": "2019-06-02 22:08:50.000000 UTC"
  },
  {
    "text": "I bought my cameras two years ago and have had no complaint until recent. I have upgraded my plan and down graded my plan with no problems until late. I called myself upgrading back to 30 days video history to find out about EBR(event based recording). The most ridiculous thing I have ever came across. Now there are patches of footage in my history that are missing. I have missed arguments that the cameras use to pick up but now don’t because no one was in view of the camera. I can not stand it. I bought the cameras because the way they function. With the upgrade I’m now generation two and the owner of 300 dollar cameras that function how google feels they should. To top it off I was paying $40per camera a year. Now to get them to function the way they were when I bought them.I have to pay $60 a year per camera. The costumer service is below average the take turn transferring you to the next person that can not help you. Defiantly a product to avoid. There are other cameras out there for cheaper. That offer the same thing cheaper and you can avoid having patches of important footage missing. The company is trying to save storage space or charge you monthly for it is my best guess. Either way it’s at the cost of the consumers sense of security.",
    "title": "Trapped in a service that I did not want.",
    "posted_at": "2021-03-13 05:36:28.000000 UTC"
  },
  {
    "text": "TEM QUE:COLOCARRRRRRR,A OPÇÃO DE:::::;::;;;:;AMÉRICA DO SUL E DA OPÇÃO;AMÉRICA DO SUL VCS COLOCAM A OPÇÃO BRASIL🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷🇧🇷",
    "title": "BRASIL",
    "posted_at": "2020-07-19 18:33:42.000000 UTC"
  },
  {
    "text": "Quando vocês vão tomar vergonha na cara e arrumar o serviço de vocês? Mais de 10 dias que funciona por 5 minutos e congela. Pelo amor de Deus até parece um produto barato….",
    "title": "Não para de congelar.",
    "posted_at": "2022-04-29 00:58:57.000000 UTC"
  },
  {
    "text": "We use our nest cameras as baby monitors. We like the capability to check them anywhere with WiFi and knew there would be trade offs given that these weren’t designed to be baby monitors. They’ve always been a bit spotty and the nest service has been down in the middle of the night at less than ideal times. However, now that they’ve forced users to merge a google account with nest account, we have had nothing but problems. We leave the app up all night to monitor our kiddos and it hasn’t stayed active without crashing in WEEKS. I have to wake up multiple times each night to re open the app and check on our kids. This is absolutely unacceptable especially given that they’re designed to be security cameras. I expected the service to improve from our previous issues with the integration with google accounts but it has been nothing but downhill from there. I am seriously considering a different product because the app experience is so poor. Get it together google. You’re supposed to set the gold standard for app experiences. If you’re a user reading this it’s probably too late and you’ve already bought the equipment to go with the app but if I’ve caught you early enough, steer clear.",
    "title": "Integration with Google has made things awful",
    "posted_at": "2019-11-23 18:39:29.000000 UTC"
  },
  {
    "text": "The products themselves are excellent quality. But this app is a huge disappointment. It has such a high latency rate - you open the app and it takes 45 seconds to load up to the main menu. (It’s not my wifi or cellular connection) So let’s consider this: your doorbell rings. You open the app, wait 45 seconds, then navigate to the doorbell where you can access the microphone and begin talking. At that point, the interaction time has been about 55 seconds. Most people, after ringing a doorbell, won’t stay at the door that long, thus by the time I can finally get to the mic the person is gone and the feature is no longer useful. Additionally, it’s a pain to guard nest guard with the app. I’ll tap the shield and it will load for 30 seconds and then say it can’t connect. I do it again. Can’t connect. After 5 or 6 times it will FINALLY arm the system. A last complaint I have is that nest is no longer integrated with HomeKit. It was previously before the company was purchased by Google. I get that Google instead wants you to use the Google home system however, as an avid Apple user, it’s frustrating to have to use 2 systems. We chose Nest because the physical products are far beyond the competition but there are some serious rooms for improvement for this application. Reduce network calls on app launch, considering auditing latency for the app and see where the problem lies, and please integrate with HomeKit.",
    "title": "Frustrating",
    "posted_at": "2020-10-17 13:18:33.000000 UTC"
  },
  {
    "text": "Porcaria",
    "title": "Imundice",
    "posted_at": "2020-08-26 13:39:50.000000 UTC"
  },
  {
    "text": "I hate this app and don't understand any of the design choices. For one, setting up the schedule requires you to randomly put your finger along an XY axis and hope that you get the time of day and temperature you were hoping for. Why isn’t there an easier way to set the specific time and temperature? I don't even know how they came up with this awful setup. You also have to set each day individually with no ability to duplicate a schedule throughout multiple days. Moreover, you should have the ability to set a temperature based on a specific sensor. As it's set up, you can either have the sensors set up to a constant preset schedule that is very rigid (morning 7-11, midday 11-4, evening 4-9, night 9-7) or otherwise choose which sensor you want to use throughout the day manually (that defeats the whole point of a programmable \"smart\" thermostat). This is extremely stupid. First, these times are completely arbitrary. Second, my days vary, as do most people's. I don't wake up at the same time on days I have to commute or over weekends, so I would like to use my bedroom sensor in the mornings up until different times. I would also like to use my office sensor only on days I work from home. I just do not understand why they made this app this way when there's an opportunity for high flexibility/programmability.",
    "title": "Inflexible for no reason",
    "posted_at": "2022-05-12 01:30:23.000000 UTC"
  },
  {
    "text": "Since google has taken over the product the app has become an exercise in frustration. A change in the wifi meant I had to reconfigure the two nests I have. It took me two days of resetting to factory settings and continually getting timeouts on trying to find the nest, trying to enter the wifi details and timeouts adding the nest to my account which btw I am refusing to convert to a google account. The alarms themselves are excellent but I will never buy one of these again because of google",
    "title": "Used to be brilliant",
    "posted_at": "2022-02-19 04:33:09.000000 UTC"
  },
  {
    "text": "Bought the cameras to replace dlink ones that stopped working after a year, it took multiple attempts by me and 2 and a half hours to troubleshoot via text on customer support, they finally added to google home app. Will not add to this (nest)app, rubbish customer support they have an option for calling but this never works so you have to do the whole thing by text. At three cameras costing $900 and a $18 month subscription the footage is great but it’s useless without customer service, would not bother with the headache again. I’ve also got a nest hub, tons of issues pretty much can’t use the camera in any app.",
    "title": "Absolutely garbage",
    "posted_at": "2021-12-14 22:48:37.000000 UTC"
  },
  {
    "text": "Sempre trava e desliga sozinho",
    "title": "Péssimooo",
    "posted_at": "2021-09-29 22:37:45.000000 UTC"
  },
  {
    "text": "Anytime I try see whats doing from a location away from home it won’t connect properly. Its not my internet. I have no issues at all with Kasa or d-link.\nOther features are great but the remote connectivity is why I rate it 1 star☹️",
    "title": "Poor remote connectivity compared to other brands",
    "posted_at": "2021-09-12 08:29:47.000000 UTC"
  },
  {
    "text": "I use the app for my Nest camera and it’s absolute garbage. If I want to review footage from the previous night it’s nearly impossible. Endless loading time, boot up time, a serious lack of controls or scrubbing options. The camera works. The footage records. But you can’t view it!",
    "title": "Absolute garbage",
    "posted_at": "2022-06-09 01:29:15.000000 UTC"
  },
  {
    "text": "For something owned by Google you would think that this app would be more intuitive.",
    "title": "Basic",
    "posted_at": "2022-06-08 18:22:12.000000 UTC"
  },
  {
    "text": "Need to improve app . When checking notifications like person detection or motion detection video hard to play keep buffering. Sometimes hard to open or open very late.",
    "title": "Need to work on app .When checking notifications keep buffering on screen.",
    "posted_at": "2022-06-08 16:38:03.000000 UTC"
  },
  {
    "text": "Falta horário para o Brasil!! Funciona bem o aplicativo e a câmera, mas o relógio não tem como configurar",
    "title": "Fuso horário Brasil",
    "posted_at": "2017-11-16 00:35:41.000000 UTC"
  },
  {
    "text": "If I get a doorbell ring notification and click on my app it takes a solid 20 seconds to show you your front door even when connected to wifi and on a brand new phone. Oh and it doesn’t show you anything more than a thumbnail either.",
    "title": "Don’t subscribe? Expect massive delays",
    "posted_at": "2022-02-26 19:03:46.000000 UTC"
  },
  {
    "text": "Like the vast majority of Nest product owners, once Google decided to force everyone to migrate, they also decided not to improve or fix the APP’s severe bugs that were created once Google created Nest Aware. All the reviews for the past year have been poor. And on top of the freezing, crashing, frozen video, opening lag, loading lad, buffering lag, signing out issue, APP overheating your device, etc. which all got progressively worse, they simply stopped updating the APP, even thought the complaints about major bugs in the APP have grown. It has been 4 months and Google has screwed over all their Nest customers. And on top of that, their customer service is absolute trash. I went back and forth with them showing them detailed video of the APPs performance issues, and then they blamed my wifi. Then I showed them video of the cameras streaming perfectly when accessing Nest through a web browser, and they said they would look into it. That was about 4-5 months ago. For those looking to buy new porducts, these cameras are great, but Google absolutely destroyed the experience. The APP is absolutely uselsss.",
    "title": "Google ruined the Nest APP",
    "posted_at": "2021-04-09 08:17:29.000000 UTC"
  },
  {
    "text": "When I first purchased the indoor cameras, motion detectors, nest aware etc everything worked great. That lasted a few months. Not sure if this is an issue with the app unable to communicate with the hardware or the hardware not communicating with the app. Now I get reminders to set alarm when we are home, constantly. Apparently it no longer recognizes when we’re home and when we are not. The indoor cameras turn on and off at will when we are home and I get constant notifications that “looks like someone is home” constantly. Yes that’s me who’s home thanks for letting me know every 5 minutes. Facial recognition you ask??? Pretty much useless since it doesn’t recognize me or any of my family members even though we have had the cameras for over a year. App CONSTANTLY sends me push notifications when we’re home. Apparently the only thing it recognizes and remembers are packages left at the front door. For such expensive hardware I’d expect it to work like its price tag would indicate. Unfortunately I’m “stuck” with all the nest hardware and therefore the app. I’d recommend going with something else that has better value for your money.",
    "title": "It used to be great",
    "posted_at": "2019-11-10 17:29:51.000000 UTC"
  },
  {
    "text": "It Doesn’t work. How can this be? Google's poor service that sells the product and does not give information that the App does not work in South America.",
    "title": "Brazil???????",
    "posted_at": "2018-11-20 18:54:29.000000 UTC"
  },
  {
    "text": "Constant freezing\nHave to pay a monthly to be able to use 99% of its features\nSigns me out almost everyday.\nSuch a horrible user experience",
    "title": "Terrible App",
    "posted_at": "2022-02-16 23:29:43.000000 UTC"
  },
  {
    "text": "Waste of money, since merger with google it changes temperature when it feels like or just turns your AC or heat off, constantly signing in wanting to share my data,",
    "title": "Junk",
    "posted_at": "2021-08-11 00:58:20.000000 UTC"
  },
  {
    "text": "Not a fan of the forced google data conversion. I get it. But no choice given.",
    "title": "Google data",
    "posted_at": "2021-08-10 01:11:50.000000 UTC"
  },
  {
    "text": "The app worked fine until it merged with google. Now I get heat when it’s set to cool and when I try to find out why this happens the thermostat goes off line and says there’s no internet even though all my other devices appear to be online. I’m sick and tired of systems blaming my equipment when clearly the problem is at the other end. In short I wish google would just bugger off.",
    "title": "Google",
    "posted_at": "2021-07-21 22:30:01.000000 UTC"
  },
  {
    "text": "I have used the nest for 9 months and just when I think I’ve got it figured out there’s another challenge. Btw…it’s just not me. I’ve asked for help from far more technologically savvy people and they r just as frustrated.",
    "title": "The nest is too challenging!",
    "posted_at": "2022-02-27 20:08:37.000000 UTC"
  },
  {
    "text": "This app is listed as free but I was billed for it, without even receiving a popup or any information of its price nor that it was paid. Apple support ignores it. Don't install.",
    "title": "Hidden fees",
    "posted_at": "2016-11-06 15:16:31.000000 UTC"
  },
  {
    "text": "I would love to give a good review but can not. My furnace had no problem with keeping my house warm until I got the nest thermostat. Now? Cold house every morning this cold season. The problem? Thermostat calls for heat furnace turns on runs for a few minutes and shuts off. I go to thermostat it’s still calling for heat but furnace is shutting down, once it goes through the lengthy shut down process of running the fan to cool off the heat exchanger it eventually shuts down, thermostat still calling for heat but furnace is off. Then it starts the process of starting up the furnace only to run for a few minutes and shut off. On, off, on/off on/off anytime the furnace is calling for heat, the furnace doesn’t stand a chance of EVER getting the house up to temp when it’s 4 degrees outside because it’s always starting up and shutting down, during these events the fan is running but no heat and there’s nothing I can do about that. SO THIS GREAT “ENERGY EFFICIENT (P.O.S.) Thermostat” makes my furnace run constantly but it can’t keep the house warm. I’m completely disgusted and at my wits end. Putting a cheap one on that WORKS!",
    "title": "Won’t stay running",
    "posted_at": "2022-02-24 11:20:50.000000 UTC"
  },
  {
    "text": "Doesn’t open every time. Video feed and sound is really unreliable even though I have really fast connection. So frustrated to have expensive cameras and subscription just it not to work properly. I can get better results with way cheaper cameras. Embarrassing from mega corporation like google.",
    "title": "Very buggy",
    "posted_at": "2021-11-07 00:11:15.000000 UTC"
  },
  {
    "text": "They haven’t made a good interface update in years!\nWhen u have two thermostats , ie one upstairs and one downstairs you should be able to see temperature for both at the same time. This app makes you click too left corner to then click again to choose which thermostat to view to see temp and then click to adjust. The circles (both) that show thermostats should ALWAYS appear on screen when you log into app so you can quickly see temp and change if desired. Also when looking at schedule it would be nice to have the time stamps fonts bigger. Hard to see small type especially at night.\nI think they are also missing a common thermostat function called ‘hold’ where you can set and keep at that temp until changed. With Nest it will change to next temp on schedule. I don’t see HOlLD— unless I’m missing it?? Easy stuff for Nest to fix. Hope they do. I like the thermostat. App should be great, not just ok.\n—-Still hasn’t had a good app or product update in two years. Also schedule settings are small to see timeline. Also that mode crashes often. Fix it already will ya.",
    "title": "Too Many Steps. Is there a temp HOLD button?",
    "posted_at": "2020-12-10 06:38:11.000000 UTC"
  },
  {
    "text": "Turns the AC and Heat off randomly. Types the review in white color on white background.",
    "title": "Keeps switching to Away",
    "posted_at": "2021-08-22 03:41:21.000000 UTC"
  },
  {
    "text": "Be aware that the Nest thermostat, though lovely to use and look at, has a known WiFi failure flaw. Google pretend that they’ll look after you with a replacement unit, but then weasel out of it due to technicalities about addresses and point of purchase. Cannot warn strongly enough how disappointed I am.",
    "title": "Useless product, no support.",
    "posted_at": "2021-09-21 06:28:11.000000 UTC"
  },
  {
    "text": "If i could give this app 0 stars I would. We use it with the Nest camera that we opted to use as a baby monitor. Total waste. We chose it because of the 2 way communication option and importantly, that your voice sounds like yours rather than something mechanical. This is critical when you’re using the device to communicate with the baby and soothe it over the monitor during night wake ups.\nLatency slows your ability to respond to the child crying immediately. But the worst thing about this app is that it CONSTANTLY goes offline. And NO, it odd not the Wi-Fi connection. We’ve checked and rechecked a million times. It does the same thing on other’ networks when we’ve taken it with us to use elsewhere. This is a problem when your baby is crying and you cannot hear and respond because this awful app is offline YET AGAIN. You then have to close and reopen it and connect to the microphone, which all takes a while because of the latency issue. By then baby’s crying has escalated to point of no return, the whole household is awake and the Nest is offline. AGAIN.",
    "title": "Huge latency and low reliability",
    "posted_at": "2022-06-18 08:41:50.000000 UTC"
  },
  {
    "text": "Like other recent reviews, the update has broken the app. Takes forever to load. Video constantly buffers when I select events or scroll through the timeline. Please fix this. I pay $180 a year for this service so I expect it work. Very frustrating and am contemplating selling the camera and buying either a Eufy or Reolink to replace.",
    "title": "Buffers endlessly",
    "posted_at": "2022-06-05 09:28:45.000000 UTC"
  },
  {
    "text": "Very dissatisfied with the proudest",
    "title": "Useless thermostat",
    "posted_at": "2021-08-11 01:24:26.000000 UTC"
  },
  {
    "text": "A nest me surpreende positivamente a cada dia",
    "title": "Melhor camara do mundo",
    "posted_at": "2016-07-10 05:22:29.000000 UTC"
  },
  {
    "text": "Keeps saying there is a problem with Nest service\nPlease try again in a few minutes but this has made it impossible to check the footage because keeps happening.\nIt’s been weeks\nIt needs an update to fix this problem.\nI pay a lot of money for this.",
    "title": "Keeps crashing",
    "posted_at": "2019-11-21 09:00:03.000000 UTC"
  },
  {
    "text": "Covid. My lumbar region was puffy, I was having severe difficulties I think I caught Covid but there were no test kits available. I had difficulties breathing, ran fever, my heart was racing at times and when my b/p was taken it was usually high.\nIn addition over the next 8 months I had teeth falling. Out. But, the absolute feeling of my skin on fire. I’m 62 and my entire life was spent trying to remember a coat, sweater, or blanket. Nest has always been a blessing when I need to turn temp. down but the entire time I have had to argue with an electronic device and I can’t win. Last Tuesday I reset the monitor 5 times while cleaning. Every time I reset the monitor within 30-45 minutes NEST would reset the monitor from 69 degrees to 74 or 75 degrees. Then when my skin started burning I would reset back to 69 to 70 and sit down for 15-20 minutes finally I gave up. We have several units and we like the convenience of Nest thermostats and being able to set them in my car, the bed, even my couch. I will probably get a base unit that I can still remotely control but it is not subject to the whims of the unit to adjust the temperature.",
    "title": "Temp won’t stay in the ranges I need. In April I think I caught C",
    "posted_at": "2021-12-19 00:11:26.000000 UTC"
  },
  {
    "text": "This app has gotten so slow it’s basically unusable for more than a couple cameras. Very disappointing.",
    "title": "Very very slow",
    "posted_at": "2022-06-11 17:27:29.000000 UTC"
  },
  {
    "text": "Work fine until I migrated with google app nothing works on any application. I redid the app and thermostat not working cannot control heat or air. Thanks google",
    "title": "Terrible App",
    "posted_at": "2021-08-30 16:29:55.000000 UTC"
  },
  {
    "text": "As far as the app goes, it keeps getting disconnected (sometimes 4 times in 5 seconds) from the nest and sometimes what you set in the app is not actually set in the nest or it does not reflect the nest state if you go to the actual device, you will see. This has been very annoying and frustrating since I paid so much for a darn thermostat just to be able to control it remotely and for a bit of smarts.\nNow for the actual Nest thermostat itself. The device looks pretty, but smart would not be amongst the words I would use to describe it. Once it latches on to a setting (“learns it”) it is almost impossible to change the setting. If it wants to set the temp to 70, and you feel like you want to change it, it will change it back. You can’t turn off the smarts completely. You have to reset it completely to get rid of what it has learned, but then it will learn again and you will be in the same place. There are multitude of other very annoying and frustrating flaws with this thing which would take much more to explain. Don’t wast your time or money on this over priced thing. I wish I hadn’t.",
    "title": "The worst smart thermostat and app",
    "posted_at": "2020-01-13 05:33:20.000000 UTC"
  },
  {
    "text": "I cant switch between cameras.",
    "title": "Problem in best cam",
    "posted_at": "2016-06-14 17:55:22.000000 UTC"
  },
  {
    "text": "Horrible!\nEvery once in a while the app forces you to re-sign in. And then your password doesn’t work. And, no, I didn’t forget it because I have it written down. How is that possible?\nBad app.",
    "title": "No, I didn’t forget my password",
    "posted_at": "2021-11-24 03:19:46.000000 UTC"
  },
  {
    "text": "Despite now being a google product you can’t link it to your google home. It’s not smart. It’s just a smoke detector that alerts my phone. I can’t link it to other smart devices and only the original account holder can access the app. $600 completely wasted. If you can, buy something else.",
    "title": "Google stuffed it.",
    "posted_at": "2020-10-22 13:54:31.000000 UTC"
  },
  {
    "text": "None of the packaging or advertising says you have to PAY for the recorded video. It’s free for the first month but then they cut you off. Now I’m stuck with 4 camera’s that only take a snap shot and hold it for 4 hours. RIP OFF!!!!",
    "title": "Cost",
    "posted_at": "2021-08-27 12:31:01.000000 UTC"
  },
  {
    "text": "Awful- can’t erase this so the unit has a mind of its own- not smart.",
    "title": "Schedule",
    "posted_at": "2021-08-30 15:37:04.000000 UTC"
  },
  {
    "text": "Very disappointed since google took over😞",
    "title": "Nest app",
    "posted_at": "2022-03-15 04:51:20.000000 UTC"
  },
  {
    "text": "When we first got the app and camera it was great. Now they have limited features and are asking us to pay for things that where included when we bought the camera. Never buying another wyze device again.",
    "title": "",
    "posted_at": "2022-10-24 17:23:31.000000 UTC"
  },
  {
    "text": "The last update got rid of sound when streaming on my Google hub screen. Have reset everything and still no sound. Have sound in the app, but not when streamed. Used to have this, now very frustrating, use as baby camera and sound is very important!",
    "title": "",
    "posted_at": "2022-10-25 14:32:36.000000 UTC"
  },
  {
    "text": "The first one we bought (yes we bought two) it broke immediately after sitting on it. While the company agreed to send a new one. They had to charge us shipping to send it to our home because we are outside the us. The second one we got worked fine but after a while the handles don’t really work as they should. I would sometimes need to bring the handles very low or very highl and we would need to reset the Hoover board numerous times to get the handles working better. Always the third time riding a piece came a part (a part that I didn’t need to put together). Anyway the attachment is fun but the straps are not wearing out and we have to tighten and adjust the board multiple times when riding. It is fun when it’s fun but we have to do a lot.",
    "title": "Different issues",
    "posted_at": "2022-08-26 19:11:17.000000 UTC"
  },
  {
    "text": "Customer service tried to get a working cart to me, which is why there are 2 stars and not 1. The cart doesn’t attach week to the board. Had to “shim” the board to create enough pressure for the board to recognize the cart was attached. Still only worked sporadically.",
    "title": "Cart is trash. Customer service tried their best",
    "posted_at": "2022-05-31 20:40:32.000000 UTC"
  },
  {
    "text": "After 2 days, the seat cracked badly in 2 spots and was unusable. Had to exchange. Suggest 3.0 having a metal seat or stronger/thicker plastic.",
    "title": "Cool adapter, but broke after 1 day.",
    "posted_at": "2020-12-29 13:03:51.000000 UTC"
  },
  {
    "text": "I have had this Jetkart for over two years now. While there were some issues with getting the kart to respond properly to the arm controls because the velcro straps would not always hold on to the hoverboard properly, we learned to live with it and were able to use the kart and were happy with it for over a year. Then the seat cracked and had to replaced. Turns out that Jetson doesn't sell a replacement seat, nothing on eBay or Amazon will replace the seat on this cart because its bolts are at an angle and no one sells a seat that fits the jetkart. So for the last year, it has been lying around waiting to be picked up by bulk trash pickup. I was unwilling to shell out $65-$80 for a new jetkart and could not come up with a solution that fits existing aftermarket seats. So as long as you don't crack the seat, its a decent kart, but buyer beware.",
    "title": "Ran well for a year but no replacement seats :(",
    "posted_at": "2022-05-31 15:32:11.000000 UTC"
  },
  {
    "text": "Need to add a drill and a mallet to needed tools. Had to use mallet to get the handles attached to the frame, there was no way it was going to work doing anything else. Seat had barely pin holes in them for the bolts, had to use drill to widen and then mallet to force them through. Also, the screws on the seat have an order that if not followed, the last one won't go in, took me 3 tries to figure that out. After finally got it together, the foot bar is not even level.\nI will give it that it attached to the board easily.",
    "title": "Assembly instructions need work",
    "posted_at": "2020-12-25 04:07:53.000000 UTC"
  },
  {
    "text": "The bike itself is fine. It’s heavy for a small kid. Biggest disappointment is the lights. They don’t work much at all. We had a replacement bike swapped for our original and the lights still don’t work very well.",
    "title": "Ok bike",
    "posted_at": "2022-04-14 22:56:50.000000 UTC"
  },
  {
    "text": "I did not really get a chance to try it out because a piece of the handle kept breaking off. It was also really hard to adjust the height of the handle bars to work for someone taller. I think it could be really useful in the age of scooter transportation to use when you need to go somewhere near by but it was a little too bulky to carry around into a building",
    "title": "broken",
    "posted_at": "2021-10-24 16:23:13.000000 UTC"
  },
  {
    "text": "The wheels didn't light up and it was a bit small with not that many height adjustments",
    "title": "Some issues",
    "posted_at": "2022-07-17 01:08:00.000000 UTC"
  },
  {
    "text": "The wyze cam+ tuning leaves quite a bit to be desired. Some improvements are necessary to boost this review. Feedback from the AI to users for better recognition. Recommended detection settings, what does 10-50 mean? I've had packages delivered that don't trigger any notification, that's a bit unnerving. Seem like low hanging fruit. Otherwise pretty good so far. The UI navigation could use a once over too.",
    "title": "",
    "posted_at": "2022-10-24 22:48:03.000000 UTC"
  },
  {
    "text": "Relentlessly trying to upsell, despite me paying monthly already.",
    "title": "",
    "posted_at": "2022-10-25 14:19:01.000000 UTC"
  },
  {
    "text": "Can't view full screen. I can pull up video, but if I want to flip it to view full screen it closes",
    "title": "",
    "posted_at": "2022-10-25 10:20:23.000000 UTC"
  },
  {
    "text": "Takes too long to Come up when someone at the door",
    "title": "",
    "posted_at": "2022-10-24 16:25:12.000000 UTC"
  },
  {
    "text": "Straps separating that holds velcro and rubber handles will slide off. But kids love it.",
    "title": "Jetcart 2.0",
    "posted_at": "2021-11-18 20:06:28.000000 UTC"
  },
  {
    "text": "This was a great product and very fun. It was my daughter’s favorite thing for Christmas to go with her hoverboard. Unfortunately after about an hour of riding the seat split in 2 places.",
    "title": "Great fun product but cheap seat",
    "posted_at": "2020-12-26 01:15:00.000000 UTC"
  },
  {
    "text": "I have a 60lbs and 70lbs kids and it still wobbles at around 8 mph. Tried adjust length and air pressure. It helps if they lean into it, especially when accelerating.",
    "title": "Woobles",
    "posted_at": "2021-09-16 00:21:01.000000 UTC"
  },
  {
    "text": "I just bought a hali x and was wondering if this would work with hali",
    "title": "Needing help",
    "posted_at": "2021-11-11 00:00:16.000000 UTC"
  },
  {
    "text": "Within the weight limits and seat broke. They offered a free replacement however because we live in Puerto Rico were were going to be charged like 30-50% the cost of a new one…smh",
    "title": "Seat broke same day",
    "posted_at": "2022-07-25 18:56:07.000000 UTC"
  },
  {
    "text": "This is a good scooter, and my son has lots of fun with it. But the design is not as intuitive as it should be. The packaging makes it seem like it's super simple to fold and unfold. But honestly, I read the (very short, not clear enough) instructions several times and just couldn't figure it out. I finally got it to unfold, so my son can use it. But now I can't figure out how to fold it for storage.",
    "title": "Good scooter but design is not intuitive",
    "posted_at": "2021-07-23 18:59:50.000000 UTC"
  },
  {
    "text": "As long as the Internet is good, all is well.",
    "title": "",
    "posted_at": "2022-10-24 15:38:49.000000 UTC"
  },
  {
    "text": "I like the cam easy to use plug and play but it would be nice to have bullet points on the playback so you can go directly to a person that has been caught on cam not just an annoying alert",
    "title": "",
    "posted_at": "2022-10-24 22:48:18.000000 UTC"
  },
  {
    "text": "Great App but miss person tracking, -1 star until its reenabled",
    "title": "",
    "posted_at": "2022-10-25 01:57:54.000000 UTC"
  },
  {
    "text": "Reliable",
    "title": "",
    "posted_at": "2022-10-24 21:47:40.000000 UTC"
  },
  {
    "text": "Great app",
    "title": "",
    "posted_at": "2022-10-25 13:41:47.000000 UTC"
  },
  {
    "text": "Great for children weighing under 100 Lbs. Heavier adult “Big children” cause light weight aluminum frame to crack. Awesome product, super fun and easy to ride.",
    "title": "Great fun!",
    "posted_at": "2022-04-21 00:11:13.000000 UTC"
  },
  {
    "text": "This is our second Jetson seat as the first one that came with the hover board was not a good one the front wheel was much smaller and eventually broke off. This new one is much better with the big sturdy front tire which is a great idea, my only issue is the straps to attach the seat to the hoverboard doesn’t last which was also an issue with our last seat. After one day of riding for my now 9 year old son the straps were tearing up and wouldn’t strap properly. we had to replace them for him to be able to ride again. Please come up with a solution to the velcro strap attachment as this is not working. Maybe try something with a ratchet strap or some kind of crank system in the future because when the dirt and dust get in the straps they’re useless. Other that he loves his Jetson all terrain",
    "title": "Great concept but need improving",
    "posted_at": "2021-05-12 10:13:07.000000 UTC"
  },
  {
    "text": "Seems well built, but will have to go to hardware store to finish build to make it under the tree. There are no washers for the bolts that attach the seat and the bolt heads slip right through the holes in the seat.",
    "title": "Well built, but missing some parts.",
    "posted_at": "2020-12-14 19:28:27.000000 UTC"
  },
  {
    "text": "Good attachment for the hoverboard my kids enjoy using it",
    "title": "Fun to use",
    "posted_at": "2018-02-25 06:00:00.000000 UTC"
  },
  {
    "text": "We bought this for our son to go with an older model jetson and one for our youngest to go with the newer model jetson. The newer model works great! Actually perfect. The older model, the foot pad centers are farther in than the attachment works for, so unfortunately it does not work quite as well because it sits so far on the edges of the pads, you have to push the levers almost to the ground for them to actually make the hoverboard go forward. If jetson made the bar that the two pads are on adjustable, it would fix this problem. But I guess we'll have to figure something out. If you are purchasing it, I would recommend getting one of the newer hoverboards to go with it. You're taking a chance if you have an older one - crossing your fingers that the pads will hit the right points. If it does, it's an awesome add-on!",
    "title": "Super fun! On the right Jetson hoverboard.",
    "posted_at": "2020-12-27 19:53:59.000000 UTC"
  },
  {
    "text": "Yep, so she was totally loving her Jetson she got for Christmas. Got down the street and just turned the corner and the battery died. It was fully charged the night before. Dang it! But we tried and tried again....got back into the garage. It hasn't moved since. She was embarrassed by some neighbor kids. I will be looking at the bikes. She's 11 going on 16 so she'd enjoy something a little higher from the ground.",
    "title": "WOO HOO, wait what??!!",
    "posted_at": "2022-03-10 21:43:46.000000 UTC"
  },
  {
    "text": "this a cheap alternative to a go cart and the kids love it. Its works, stable and we haven't had issues with it. Its adjustable for different heights, compact for easy storage. The only issues I have is that the belt attachment goes around the charging port so we would have to work around that to charge our jetson hoover.",
    "title": "easy set up and fun ride",
    "posted_at": "2018-07-03 05:00:00.000000 UTC"
  },
  {
    "text": "I got this scooter as a replacement for a smaller scooter. It’s is much bigger than a kid’s scooter. The box says 8+ but it’s too big for my 9 year old boy. It’s even a little too big for my 11 year old. That said the base is wide and has plenty of room to stand on. It’s well made and very sturdy. I worry about fingers getting pinched when it’s folded / opened so we are keeping it open. It’s a great scooter, just not for younger kids.",
    "title": "Great scooter!",
    "posted_at": "2021-07-06 18:15:39.000000 UTC"
  },
  {
    "text": "This is a good item to have handy with the kids during summer outdoors. It keeps them busy and they seemed to like it a lot. It's not too heavy and me and the kids are able to easily carry it wherever we go. The item seems to be made well and is pretty sturdy.",
    "title": "Good For Summertime Fun",
    "posted_at": "2021-07-05 02:24:30.000000 UTC"
  },
  {
    "text": "The Hex Kick Scooter is so light-weight that it's easy to just fold and go! Assembly was a breeze & so far it's been very convenient! I've purchased other scooters in the past that have been heavy & awkward.",
    "title": "Convenient!",
    "posted_at": "2021-07-08 11:13:59.000000 UTC"
  },
  {
    "text": "An excellent gift for any child who likes to explore the outdoors and go fast (relatively)! The brand is quality and this is no exception. It has a durable build and sleek colors. It is stable enough to catch on quickly. Overall a great way to be active and even travel short distances.",
    "title": "Perfect gift and safe",
    "posted_at": "2021-07-20 15:46:48.000000 UTC"
  },
  {
    "text": "I like the simple but elegant design of this scooter. The black and chrome make it a good fit for an adult rider. Overall compact and lightweight also make it a good travel companion! I cruised around my neighborhood with this easily, not sure how it would hold up on faster thoroughfares like bike paths etc.",
    "title": "Sleek design",
    "posted_at": "2021-08-02 09:13:48.000000 UTC"
  },
  {
    "text": "I got this a few weeks ago for my 8 year old. It is easy to set up from the box. You lock in the bar that holds the handles by pushing upward and securing into place with a lever on the side. You then adjust the height of the handle bar to your child’s height, and you are good to go! There are two wheels in the front and one in the back. It is stable and my child felt steady on it. It took her some time to learn to steer it. With two wheel scooters, you steer with the handle bar. With this scooter, you steer by shifting your weight. Once we realized this is how you steer, she caught on quickly. Turns are more gradual and not sharp. This scooter seems well made and like it will last a while.",
    "title": "Fun scooter",
    "posted_at": "2021-07-31 12:34:37.000000 UTC"
  },
  {
    "text": "This is an awesome little scooter!It was very easy to assemble and you can adjust it to height. The tires also light up when the wheels roll. Overall it is a great little scooter and I'd recommend it to anyone I know.",
    "title": "Great little scooter!",
    "posted_at": "2021-07-27 01:51:40.000000 UTC"
  },
  {
    "text": "I got the Gleam Kick Scooter in the color red because my boy who is 3 needed something a little easier to balance. This scooter you can break with and has wheels that light up. How cool is that? Awesome!!! It is adjustable for different heights and all in the click of a button. I love this thing. I feel like it is more safe because of a wider base and he can actually balance. Wider handles to hold on to and it was super easy to put together. Came in box and only had two parts. Seconds to assemble. He’s going to be the coolest dude on the block with these light up wheels. This kick scooter is great for kids from 3-10 . I do feel like it goes slower than other scooters but that’s what I’m looking for when it comes to my 3 year old on it.",
    "title": "Super Cute!",
    "posted_at": "2022-01-25 07:02:45.000000 UTC"
  },
  {
    "text": "This is a really cute scooter for little ones. The foot part is big enough that they can put both feet up on the scooter. The 2 front wheels light up when it moves, so my son thinks that’s really cool. I like that the brake on the back is one piece, so they can’t get their little foot stuck between the break and the wheel. Definitely a cute scooter for little ones, but I’d say maybe too small for anyone over 5 or 6 years old.",
    "title": "Cute scooter!",
    "posted_at": "2021-12-20 16:10:11.000000 UTC"
  },
  {
    "text": "This is a super cute scooter for the younger set. Although it’s adjustable, it looks and feels like it’s for under 8s. The handle system allows for easy steering. The base is wide. It’s a nice easy smooth ride for little kids. And it looks great. Highly recommend",
    "title": "Very cute!",
    "posted_at": "2021-12-21 14:24:02.000000 UTC"
  },
  {
    "text": "This is my fifth electric bike. Appears well made and works well. It folds nicely and will fit into most car and SUV trunks. Relatively light enough to fold and pickup. Has good range, is easy to charge, very loud built in horn, cool alloy (non spoke) wheels and super disc brakes. Areas for improvement, is not fast enough for an electric bike. The gearing needs to change to allow faster than 15 mph top speed in pedal, pedal assist and full EV mode. 20+ mph would be great. There is no support or instructional manual for changing settings on the computer(adjust for tire diameter, pedal assist settings,mph/kph etc), nor does Jetson customer service offer any insight on how to change the settings. Has a front light but no red safety light in the rear. Would also recommend 20\" BMX type tires that would allow some minimal off road and unpaved path riding. With those changes, it would be an unbeatable EV bike for the price point!!!",
    "title": "Great Compact folding 20\" Electric Bike",
    "posted_at": "2022-09-15 16:38:39.000000 UTC"
  },
  {
    "text": "Works wonderfully. Connects with devices flawlessly. The camera are fantastic. Very pleased. Good color during day, in darkness, converts to B&W but used ambient light well for a good night picture. We keep an eye on our barking dog when he's left alone. Insurance for safety!",
    "title": "",
    "posted_at": "2022-10-24 19:44:23.000000 UTC"
  },
  {
    "text": "Work as needed",
    "title": "",
    "posted_at": "2022-10-24 22:44:03.000000 UTC"
  },
  {
    "text": "Best cam out there for the money.",
    "title": "",
    "posted_at": "2022-10-24 17:55:48.000000 UTC"
  },
  {
    "text": "Best camera ever, I can make sure my fur babies are safe 💕",
    "title": "",
    "posted_at": "2022-10-24 23:33:41.000000 UTC"
  },
  {
    "text": "When it works, it works very well. Seems to go offline a lot. That could be my clients internet. I'm pleased, the video is very clear .",
    "title": "",
    "posted_at": "2022-10-24 21:49:26.000000 UTC"
  },
  {
    "text": "The app works. Helped catch a thief in an overnight vehicle storage yard. Triggered motion tracked and notified. We were able to trap, relocate and release. The racoon. The workers had been leaving the trash can unsecured. :-)",
    "title": "",
    "posted_at": "2022-10-24 17:30:31.000000 UTC"
  },
  {
    "text": "Wyze has been easy to use and customize to fit my needs. I really enjoy the wide range of products and how they all work easily with the app.",
    "title": "",
    "posted_at": "2022-10-25 13:40:43.000000 UTC"
  },
  {
    "text": "Love them works great for me just what I needed",
    "title": "",
    "posted_at": "2022-10-25 11:31:31.000000 UTC"
  },
  {
    "text": "I use the go kart attachment when I am not feeling so adventurous as to riding the hover board by itself. The go cart is a lot of fun and can do more things than just a hover board alone. The only problem is with the Velcro straps, I’ve had to replace them twice. But this is not a mechanical issue in my opinion so I believe the go cart should still get five stars.",
    "title": "All the fun with out the balancing aspect!",
    "posted_at": "2022-05-18 19:51:46.000000 UTC"
  },
  {
    "text": "fits perfectly with our jetson hoverboard! our son has so much fun!",
    "title": "son loves this!",
    "posted_at": "2022-10-17 19:17:18.000000 UTC"
  },
  {
    "text": "My daughter loved her hoverboard but after a while got bored with it, then for Christmas we got her the jet kart attachment and it brought the hoverboard back to life! It’s faster with the jet kart than the hoverboard alone it seems and she loves it. The wheels are smooth and now she rides it everywhere. It’s easy to attach and lots of fun!",
    "title": "Fast and Fun",
    "posted_at": "2022-04-15 12:39:21.000000 UTC"
  },
  {
    "text": "We purchased this a year after buying the hover board. It assembled easily and worked very well. We are looking forward to warmer weather so we can use this outside.",
    "title": "Easy to use",
    "posted_at": "2018-01-13 06:00:00.000000 UTC"
  },
  {
    "text": "solid build and easy to assemble despite instructions seemingly for another model. Kids are enjoying it.",
    "title": "Fun and easy to assemble",
    "posted_at": "2022-08-13 00:44:19.000000 UTC"
  },
  {
    "text": "Daughter loves it, she was scared of the hover board, but with this on it...she can't get enough.",
    "title": "A must buy.",
    "posted_at": "2022-07-22 03:57:48.000000 UTC"
  },
  {
    "text": "Happy with the purchase especially after having to send a different brand back twice because it arrived broken (twice). My only complaint is the battery life is so short but overall am happy with it.",
    "title": "For my Grandson",
    "posted_at": "2022-04-24 22:50:26.000000 UTC"
  },
  {
    "text": "Son loves riding this at our house. Goes good on the concrete",
    "title": "Works great for my 7 year old",
    "posted_at": "2018-06-17 05:00:00.000000 UTC"
  },
  {
    "text": "We have had multiple carts for our hover boards and this is the only one to survive a week! After many hard and fast rides in grass, gravel, cement, and asfault this kart* has been solid where others have broken in multiple ways! This is best on the market! Hands down perfect!",
    "title": "Perfect choice",
    "posted_at": "2018-07-11 05:00:00.000000 UTC"
  },
  {
    "text": "I got jetcart for youngest grandson because of balance issues. He loves it and can get out and enjoy with his brother. They both live there Heston rides.",
    "title": "Cool ride!",
    "posted_at": "2022-05-31 15:27:26.000000 UTC"
  },
  {
    "text": "The JetKart 2.0 Universal is quite remarkable. It rides great. Only thing missing that'll set it all the way on fire is the light wheel, the one like the other JetKart has that lights when it's spun. Oh and I jus noticed the wheel is actually air pumped n not that hard plastic. Still 5stars even without the light wheel...GREAT JOB JETSON!!",
    "title": "ATA",
    "posted_at": "2021-05-06 02:16:26.000000 UTC"
  },
  {
    "text": "Bought 2 for Christmas as well as 2 Jetson hoverboards, for my 45lb 5 year old and my 90lb 9 year old boys. These carts are very well made with 2 tube supports, low profile handles and a bucket seat that the boys find comfortable. The shocks on the back help stabilize the cart and the larger than standard front wheel make it a great gift. Dont skimp on the hoverboard. Spend a little more and get a Jetson. These carts are very fast. My 5 year old runs his wideopen like a little Chase Elliott. I will only buy Jetson from now on.",
    "title": "Perfect fit for a 5 year old up to adult. Great product",
    "posted_at": "2021-01-07 02:09:40.000000 UTC"
  },
  {
    "text": "This cart worked very well with my son's new Jetson Hoverboard. It was easy to put together and provides him with HOURS of fun. Highly recommend!",
    "title": "Awesome Kart",
    "posted_at": "2022-06-21 12:18:26.000000 UTC"
  },
  {
    "text": "My 7 year old loves this! It has shocks and a larger front wheel unlike other brands. She has only had it a few days but so far it’s been great!",
    "title": "Great hover kart!",
    "posted_at": "2022-08-31 19:26:37.000000 UTC"
  },
  {
    "text": "We received it in very good packaging. We were able to get it out together.",
    "title": "Hoverboard seat!",
    "posted_at": "2020-12-07 22:48:35.000000 UTC"
  },
  {
    "text": "Made very durable and is so much fun for the whole family",
    "title": "Lots of fun",
    "posted_at": "2018-03-25 05:00:00.000000 UTC"
  },
  {
    "text": "My 8 year old loves this! It was fairly simple to assemble, and so far we haven't had issues with anything. He's been using it daily for about 2 weeks now.",
    "title": "Love it!",
    "posted_at": "2022-09-01 23:18:51.000000 UTC"
  },
  {
    "text": "This accessory made riding my sons hoverboard even more fun. He was able to do all types spin outs and so on.",
    "title": "Awesome product",
    "posted_at": "2018-07-13 05:00:00.000000 UTC"
  },
  {
    "text": "Kids love it! Rides much smoother with the bigger front wheel",
    "title": "Go-cart madness",
    "posted_at": "2021-08-02 21:32:14.000000 UTC"
  },
  {
    "text": "Bought this for my 11 year old grandson because he wanted the hover board. This balancer made it the perfect gift so we don't have to worry about any broken bones!",
    "title": "Makes for a perfect ride!",
    "posted_at": "2018-01-17 06:00:00.000000 UTC"
  },
  {
    "text": "I brought it as Christmas gift to my son he loves out and let’s all the kids in neighborhood",
    "title": "Great product reasonable price My son loves it",
    "posted_at": "2022-10-25 19:46:05.000000 UTC"
  },
  {
    "text": "This is a great little hoverboard attachment. It is extremely well built and very easy to attach to the hoverboard. It is easily adjustable to be able to accommodate my youngest child all they way up to me. AND this thing is FUN!! I highly recommend!",
    "title": "Excellent!",
    "posted_at": "2018-03-08 06:00:00.000000 UTC"
  },
  {
    "text": "Fits great on Jetson board and the adjustable length makes it perfect for kids 5 to 59. Glad we got this for sons Christmas present.",
    "title": "Awesome attachment to extend fun with hover board",
    "posted_at": "2018-01-20 06:00:00.000000 UTC"
  },
  {
    "text": "I found this to be the best addition to my hover board.",
    "title": "GREAT",
    "posted_at": "2018-02-23 06:00:00.000000 UTC"
  },
  {
    "text": "This Jetson bike is the sweetest bike. First, when it arrived, it was packaged really good. I have never seen a product packaged quite like this. There was no way that there was a scratch anywhere with the protection around every part. The instructions were attached to the handlebars and were very clear and easy to understand. They even showed me what a washer and an axel nut looked like! Even I, a Grandma, was able to put this together. I did change up the order in the directions a little bit. I put in the handlebars and seat first so I could turn it upside down to put on the tire and everything else. Then, put in the batteries, press the button and hold for five seconds and the lights come on. According to my granddaughter, they are magical! I couldn’t get the lights to work on the tire air valves. I believe there might have been a short in them because they came on and then they went off and I couldn’t get them to stay on. But I still gave this bike five stars because you don’t really need the air valve light when you have the lights down both sides and on the training wheels. It is so bright and cheerful. And it really is a safety feature. It also has a cute little bell and an easily adjustable seat. This bike is a great find!",
    "title": "You want this Jetson Light up bike!!!",
    "posted_at": "2021-07-30 18:49:33.000000 UTC"
  },
  {
    "text": "This bike i love the color and very easy to assemble it was very cute and i like the little light its change many different color i like everything about this bike my daughter love to use it because its really wonderful to use very cute and training bike",
    "title": "Great Products",
    "posted_at": "2021-07-26 13:45:36.000000 UTC"
  },
  {
    "text": "I got this bike as a replacement for my daughters bike she has out grown. We chose to go with this light up bicycle to continue our journey with jetson. We have several jetson products they proved worthy. The bike comes nicely packaged with everything you need to put it together and is pretty straight forward in assembling.\nSo far all she wants to do is ride it at night to see the lights. It’s a great back bike all around and highly commended. Why get a regular bike when you can have a bike that lights up. I wish they had this when I was a child. Lol.",
    "title": "Daughter could not be more excited",
    "posted_at": "2022-10-15 15:21:11.000000 UTC"
  },
  {
    "text": "I bought this bike in black for my 4 year old nephew and he absolutely loves it !!! Right size !! And beautiful with the lights",
    "title": "Awesome birthday gift for my 4 year old nephew",
    "posted_at": "2022-07-26 23:19:28.000000 UTC"
  },
  {
    "text": "This bike is awesome!! My 7 year old son is a huge bike lover. This is small for him but it’s the perfect “trick” bike to use on his jumps. The bike has multiple color settings. It also comes with two packs of lights that attach to the wheels light light up when riding. I highly recommend this bike. Easy assembling and a head turner for sure!",
    "title": "Awesome Features",
    "posted_at": "2021-07-22 16:14:21.000000 UTC"
  },
  {
    "text": "First off it came very well packaged it's a really awesome bike it has a has lights on the tires and even down on the training wheels the lights go down in the bars of the bike which is the body it's a really nice bike it is very adorable it's very strong and your children or grandchildren would love you for it is very awesome it was very easy to put together it was a very good value is also good quality everything that you need it came with it your tires light up even down to the training wheels it is really awesome your children would enjoy this for hours and hours on in this is great for birthdays this is great for also For Christmases are just a gift they would really enjoy it's even awesome because you could take off the training wheels once they get used to riding a bike it has a bell on it that they can ring as they playing with their bicycle and riding it they have lights on the inside of the tires as well as the training wheels and even down the body of it the seat is very comfortable for him they would really enjoy it if they're out in the dark is easier for someone to see them because of the lights which is a big plus",
    "title": "Great fun",
    "posted_at": "2021-07-21 20:37:53.000000 UTC"
  },
  {
    "text": "My son LOVES THIS BIKE. He just turned 4 and it’s perfect for him…plus it will grow with him! The lights are so cool and the neighborhood kids are always wanting to ride it too:) I love that it’s not a character bike, but sleek and matte black. And it has a bell that came on it already installed!",
    "title": "Best bike ever",
    "posted_at": "2022-08-11 23:53:55.000000 UTC"
  },
  {
    "text": "We got this bike for my daughter. She loves the bike. The way it lights up and looks is super cool! It was pretty simple to put together but definitely have to spend a little time doing that. She will be enjoying it all summer.",
    "title": "Cool bike",
    "posted_at": "2021-07-25 16:31:40.000000 UTC"
  },
  {
    "text": "My daughter has a bike that she doesn’t feel comfortable riding, so we wanted to try something else. This bike was so incredibly simple to put together right out of the box. Everything you need is right in the box! My daughter got on the bike easily. She took off with confidence right away! Such a smooth ride! Most bikes with training wheels are wobbly, which is what made my daughter nervous to ride. Not this bike! The training wheels are almost like rollerblade wheels. So smooth! My daughter also loved the purple color and flashing lights. I have a feeling she’ll be riding without training wheels before we know it because of this great bike!",
    "title": "Smooth ride!",
    "posted_at": "2021-07-22 23:47:48.000000 UTC"
  },
  {
    "text": "This bike is easy to assemble. It is really cute. The kids really like how it lights up. Comfortable to ride. This bike is really a lot of fun for the kids. Directions was easy to follow. I would definitely recommend this bike.",
    "title": "Easy to assemble",
    "posted_at": "2021-07-26 16:37:55.000000 UTC"
  },
  {
    "text": "This review is for JLR M Light-Up Kids Bike. The assembly was very easy about 10 minutes to get everything together. The bike is very light and rides smoothly. The training wheels also light up, which is a really cool feature. They are good quality training wheels and don't rattle a lot.",
    "title": "Great idea",
    "posted_at": "2021-07-22 00:16:22.000000 UTC"
  },
  {
    "text": "This is a very nice kids bike. The assembly process was super easy. All the parts fit perfectly together and even the included wrench was sturdy, heavy duty, and comfortable to use. I didn’t need any other tools besides the provided wrench.\nThe bike is made of quality materials and it is very durable. My son is 4 and rides it now on the lowest seat and handlebar setting. Judging by the durability and available height settings he’ll be using this bike for a long time.\nThe black color looks sleek and makes the lights really stand out. The lights on the frame require 3 AA batteries (not included). I like that they can be turned on and off and that there are different light patterns. The training wheels are very sturdy and fit perfectly. The lights on the training wheels turn on during riding. There are also valve lights for the wheels (2 white lights and 2 multicolor lights are included), which turn on when the bike is in motion.\nMy son is crazy about his new “super cool big boy bike” and I appreciate how sturdy and well made it is. This bike is a big winner in our book!",
    "title": "Nice",
    "posted_at": "2021-09-22 18:57:32.000000 UTC"
  },
  {
    "text": "I have never seen such a cool bike!This bike has so many great qualities! First it has lights on the bars and wheels and training wheels.They do a great number of different ways to light up the blink the strobe they are solid colors.so many different colors.it is a strong sturdy bike.you can put the seat and handle bars up and down so my grandson can ride it for many years to come.",
    "title": "Awesome unique bike",
    "posted_at": "2021-08-04 20:00:54.000000 UTC"
  },
  {
    "text": "The Hex kick scooter is so much fun to ride. Us adults and kids take turns riding it around. It rides really smooth. The base that you stand on is spacious and very sturdy. The big wheels are really cool. I definitely will be purchasing a few of this exact scooter for each kid.",
    "title": "Great Features",
    "posted_at": "2021-07-01 17:17:38.000000 UTC"
  },
  {
    "text": "We purchased 3 of these in different colors and the girls absolutely love them. Great for country living with limited pavement options. They even took them to Church Camp and due to the actions of some older boys, 2 of them came back broke. I contacted support to get spare parts and they covered the damage under warranty! Friendly and quick service and would highly recommend these products. Can't wait to purchase another Jetson product in the future.",
    "title": "My Girls Absolutly Love It!!",
    "posted_at": "2022-08-19 17:44:58.000000 UTC"
  },
  {
    "text": "This is a quality made scooter. It was very easy to assemble and is very easy to use. It rides nice and smooth and looks great. I have gotten a lot of compliments on its appearance while riding it. It is a great functioning scooter and I just love when I get to ride it.",
    "title": "Great detail!",
    "posted_at": "2021-08-04 14:29:11.000000 UTC"
  },
  {
    "text": "The Hex Big Wheel Kick Scooter is really, really nice. It is foldable which makes it easy to take with you where ever you go. The Hex Scooter has comfort grip handles and the handle bars are height adjustable from 35.6\" - 39.2\". The Hex Scooter has a durable frame, 8\" wheels, 6\" Wide Deck, and a rear foot break. The weight limit is 220 lbs so not only kids can enjoy riding this awesome Hex Scooter, adults can enjoy riding it as well. The Hex Big Wheel Kick Scooter is a really fun scooter and it rides really smooth. My youngest son is 9 years old with Autism and is non verbal. He owns two other scooters with smaller wheels that for some reason he cannot ride them so well, but the Hex Big Wheel Kick Scooter the first time that he tried it out he was able to control it well and he now rides it every day through the house. I think the big wheels makes the Hex Big Wheel Kick Scooter ride smoother then the scooters with smaller wheels. The Hex Big Wheel Kick Scooter is so awesome! My whole family of four enjoy riding it! We absolutely love the Hex Big Wheel Kick Scooter! I am going to purchase one for each of us! I give the Hex Big Wheel Kick Scooter an A+++",
    "title": "Smooth Ride",
    "posted_at": "2021-07-03 06:21:22.000000 UTC"
  },
  {
    "text": "I recently got the hot pink one for my niece it is so amazing and great rides smooth super fast she loves it and the color easy to assemble and take apart the handle has many different settings for different size kiddos I will def recommend this to anyone with adventures kiddos.",
    "title": "Great ride",
    "posted_at": "2021-07-19 07:04:38.000000 UTC"
  },
  {
    "text": "My daughter LOVES this scooter, she has been riding it non stop through the neighborhood. She loves the vibrant hot pink color too ... I am impressed by her quality, made with a solid steel frame, and very strict and adjustable (would fit a 6 year old through a small sized adult). Easy to assemble, perfect birthday gift.",
    "title": "My 9 year old is obsessed",
    "posted_at": "2021-07-08 17:45:11.000000 UTC"
  },
  {
    "text": "I really liked the product, my granddaughter is delighted with the scooter the handlebar adjuster is suitable for different ages of child. The color is beautiful and it is modern and it is also of very good quality. I highly recommend it",
    "title": "Scooter",
    "posted_at": "2021-07-07 01:22:03.000000 UTC"
  },
  {
    "text": "I have a 10 year old daughter who fell in love with this scooter the moment she seen it for her birthday! It is the perfect height and lightweight for her to carry if she needs to. We love the design and how it has led lights for at night. Definitely a winner in my household!",
    "title": "Excellent",
    "posted_at": "2021-07-04 15:34:18.000000 UTC"
  },
  {
    "text": "Bought this for my grandkids. The handlebars were missing and they sent me a whole new scooter. Great customer satisfaction and the kids are so happy, which makes this Bana happy!",
    "title": "Grandkids love it!",
    "posted_at": "2022-06-24 23:02:47.000000 UTC"
  },
  {
    "text": "I like how smooth it rides and how well it holds up. It is a very sturdy scooter and holds up to 220 pounds. The wheels are bigger so easier to use. If you are looking for a scooter this is the one to get",
    "title": "great features",
    "posted_at": "2021-06-30 18:33:05.000000 UTC"
  },
  {
    "text": "This is a great quality scooter. It is a beautiful green color with bigger wheels than a traditional scooter is. It is very easy to use and my kids are happy to have this. With this beautiful weather it is a wonderful addition for outside play.",
    "title": "Great quality",
    "posted_at": "2021-06-28 22:31:20.000000 UTC"
  },
  {
    "text": "I received this and gave it to my grandson,who's 9.It is a cool green color and he loves it!He caught the hang of it right away and has been riding up and down the street.I'd say it's a hit!I would definitely recommend it.",
    "title": "awesome!",
    "posted_at": "2021-07-01 02:49:52.000000 UTC"
  },
  {
    "text": "Got thia for my son and its pretty cool. Was able to adjust it to fit him perfect. Rides very smoothly and is very sturdy very easy for him to steer. Very happy with this product over all. Cant wait to get the other kids one to now.",
    "title": "Cool for little kids",
    "posted_at": "2021-06-30 05:07:54.000000 UTC"
  },
  {
    "text": "My 8 year old absolutely loves this scooter! We’ve had it for a couple weeks now and he uses it daily. The larger wheels make for a much easier ride than his other scooter- they ride over large cracks with ease. He has it on the lowest height handlebars, but the higher settings could easily fit a much taller kid. The blue color looks really nice and the scooter is really well made. It seems like it’ll hold up to whatever he puts it through.",
    "title": "Couldn’t be better",
    "posted_at": "2021-07-07 01:55:14.000000 UTC"
  },
  {
    "text": "I love this scooter. Love that it has the bigger wheels which makes it easier to keep your balance on. The wide foot pad is big for both of my kids feet. It is easy to adjust in height so your child or an adult can ride. Love the neon green color of mine. Very high quality and durable. My daughter loves it. Great priduct i highly recommend this to anyone looking to get their older child a new one.",
    "title": "Great product",
    "posted_at": "2021-07-01 09:25:50.000000 UTC"
  },
  {
    "text": "This scooter is really well made and looks really sharp. I got this for my 11 year old but it will support an adult with no problem. The big wheels make it handle bumps and rocks with ease. The grips are made out of rubber like a quality bike grips and the deck has quality grip tape on it.",
    "title": "Well made scooter",
    "posted_at": "2021-07-01 16:15:06.000000 UTC"
  },
  {
    "text": "This is super easy to put together straight out of the box. The rubberized wheels are smooth. It even has a kick stand which is super convenient. Non slip finish. The handlebar is also adjustable for height.",
    "title": "Adjustable",
    "posted_at": "2021-06-30 00:39:21.000000 UTC"
  },
  {
    "text": "I really enjoyed the kick scooter from Hex. What I liked most about this product is how well made it is. Compared to other s, this scooter is very well made. It isn't flimsy at all. The handle on it adjusts to your liking. It has a break on the back , in case you need to stop on it. The colors make the scooter pop while riding outside. It catches many eyes while going by on it and we got several ohhs and ahhs. My kids enjoyed the scooter and had loads of fun on it. You can ride it just on about anything. Grass, cement, pavement. The scooter won't let you down. I will recommend this product to family and friends. Thank you!",
    "title": "Off in a scoot!",
    "posted_at": "2021-07-10 04:25:33.000000 UTC"
  },
  {
    "text": "Got this as a replacement for my son's regular scooter. While it doesn't seem capable of doing as many \"tricks\" as other brands, overall it's a much better scooter. It's built sturdy and it's quite a bit larger than standard scooters. That's primarily the reason we got it anyway. The platform you stand on has a larger surface area allowing you to stay on it & upright easier. The wheels are large and of a much softer material than others. It rides down the street a lot quieter than his previous scooter. Overall, this thing is great. It even has a kickstand so you don't have to just drop it on the ground when you're done.",
    "title": "Son loves it",
    "posted_at": "2021-07-09 20:43:34.000000 UTC"
  },
  {
    "text": "These scooters are so much fun. My kids and even I love them. They are very easy to put together just a couple screws and they ready to go. They go fast and very smoothly and easy to balance on them. Fun fun fun!",
    "title": "So fun",
    "posted_at": "2021-07-06 21:50:37.000000 UTC"
  },
  {
    "text": "This Hex Kick Scooter is wonderful. My daughter loves it and loves the color. Easy to put together and use. Nice ride. Very durable. I would recommend this to anyone who has kids. We love ours..",
    "title": "Great Product",
    "posted_at": "2021-07-02 15:17:28.000000 UTC"
  },
  {
    "text": "I got this for my 11 year old daughter and she absolutely loves it the bigger wheels allow for easier balance the brakes work really well the steering is smooth it has became her favorite outside toy and with that I'm one happy mom because it's so hard to get these kids outside",
    "title": "Kids fav",
    "posted_at": "2021-07-02 15:11:15.000000 UTC"
  },
  {
    "text": "My 8 year old daughter loves this scooter! It’s heavy and such good quality. The wheels are so smooth and it was super easy to assemble. My daughter says that it feels very sturdy and fast and that it’s easily the best scooter she’s ever had! So awesome!",
    "title": "So nice!",
    "posted_at": "2021-06-29 13:57:28.000000 UTC"
  },
  {
    "text": "Great scooter! Excellent costumer service!! Would buy this brand again for sure!!",
    "title": "Great scooter",
    "posted_at": "2022-07-26 03:23:42.000000 UTC"
  },
  {
    "text": "I got this for my grandson and he loves the scooter. He had a smaller spiderman one but got to big. He said I feel like a big boy now grandma. The Hex scooter was easy to put together and my grandson had a ball on it. I got the red and black one and them are his favorite colors. Thank you for letting me try your product.",
    "title": "Cool Ride",
    "posted_at": "2021-07-02 15:18:16.000000 UTC"
  },
  {
    "text": "This scooter is so cute and my daughter loves it. The color is pretty. The scooter is very well made. Great quality. It was way better than I expected. Its bigger than most scooters which is great. My almost 13 year old can ride it comfortably.",
    "title": "So cute",
    "posted_at": "2021-07-08 16:05:50.000000 UTC"
  },
  {
    "text": "This scooter looks stunning! The colors and design look so beautiful. It was very easy to set up and took me less than 10 minutes. My kids are having a blast riding it around. It glides smooth on the cement and functions just as it should.",
    "title": "Beautiful scooter",
    "posted_at": "2021-07-02 19:39:16.000000 UTC"
  },
  {
    "text": "We purchased one scooter for our oldest daughter for her birthday and our younger two girls constantly want to use it, even though they have other scooters of their own. I guess we will need to upgrade their scooters for their upcoming birthdays or Christmas...if for nothing else, for our own sanity! We love it! My only advice is to make sure you purchase one for each of your children! :)",
    "title": "Too Good to Share",
    "posted_at": "2022-10-17 19:24:51.000000 UTC"
  },
  {
    "text": "I received this AMAZING scooter to review!!!! I wanted my niece to ride the scooter because she LOVES scooters and she absolutely LOVED it! I really liked that fact that the wheels were bigger than a normal scooter. It made me feel like it was a little safer. I LOVE the color of the scooter! I would definitely recommend this scooter!",
    "title": "My niece LOVED it!",
    "posted_at": "2021-07-02 07:05:53.000000 UTC"
  },
  {
    "text": "The red Hex scooter that I got was pretty light weight-wise and the durability factor seems to be well-built. This scooter product is for my 8-year son and daughter to share during the summer months. It seems to be pretty-well assembled and definitely lives up to the fun factor. The handle is sturdy and the wheels are well-aligned and tempered. My kids love the fun factor and always wanted to have a scooter that fit their active needs. This scooter by Jetson seems to do the job just fine and I think it will be a well-cherished product in our family. This scooter works well and the manufacturer needs to advertise this product more prominently in stores or websites. It's a fine product and works well. Thanks!",
    "title": "Great Scooter for Kids!",
    "posted_at": "2021-06-30 07:59:09.000000 UTC"
  },
  {
    "text": "Perfect scooter an size for my daughter she loves it",
    "title": "I love the kickstand",
    "posted_at": "2022-07-27 02:03:57.000000 UTC"
  },
  {
    "text": "I got this product a few weeks ago and I am glad I did. Our son has enjoyed riding this. It has firm comfort grips on the handles. It is very durable. I was surprised at how the rear foot brake works. This was a good feature. I love how it folds down and is portable.",
    "title": "Great ride!!",
    "posted_at": "2021-07-05 22:41:34.000000 UTC"
  },
  {
    "text": "My 10-year-old daughter loves this scooter from the moment she saw it, easy to set up as one two three. She loves the entire color scheme especially the wheels and handles wraps are soft and you can tell it's made from very good materials. Plus folding is easy and allowed us to include it in the car for road trips. I would recommend this amazing scooter",
    "title": "Great Scooter",
    "posted_at": "2021-07-29 02:16:44.000000 UTC"
  },
  {
    "text": "I got this for my daughter and she absolutely loves it. Her last scooter had small tires and the handle bars didnt raise up enough for her but this one is great the handle bars are adjustable and the tires are bigger it also has a kick stand . She is absolutely ecstatic about it I cant get her off of it she just wants to keep riding it",
    "title": "Love it",
    "posted_at": "2021-06-29 21:03:38.000000 UTC"
  },
  {
    "text": "When I ordered this scooter I was thinking about my kids at first, but when it arrived I realized it was big enough and sturdy enough for me! (Bonus). The wheels are solid and remind me more of skateboard wheels. The board that you stand on is fairly wide and easily has space for both feet (even if they are large). The weight limit on this scooter is 220 pounds. The board also has some good grip/deck tape on it so that your feet don't slip. The whole scooter is extremely sturdy and I'd like to take it to the local skate park in the near future to try it out there. Overall, very satisfied with this scooter!",
    "title": "Durable and Large Scooter",
    "posted_at": "2021-07-21 05:33:15.000000 UTC"
  },
  {
    "text": "I am very happy with this scooter. It has a vibrant color to it and rides very smooth. It has a kick stand which was a really cool added bonus. Turns easily and has different heights for the handle bars.",
    "title": "Pretty nice scooter",
    "posted_at": "2021-07-09 14:32:07.000000 UTC"
  },
  {
    "text": "My kids have been using their new scooter for about 5 days now. This thing is extremely durable and rides really smoothly. We have a few electric scooters also and while we enjoy using those, I enjoy not having to remember to put them on the charger and add them to our electric bill. This scooter is perfect because it allows for great exercise and is suitable for young children or teens up to 110 pounds. It folds up nicely to allow to easy storage. We love it!",
    "title": "Kids love it",
    "posted_at": "2021-07-05 12:54:41.000000 UTC"
  },
  {
    "text": "The Jetson Hex scooter is perfect for the “big kid” that have outgrown traditional scooters. It has a weigh limit of 220 lbs so it’s even suitable for an adult to ride. The assembly was very simple. Just pop on the handlebars and screw them in and it’s good to go. It’s very sturdy and easy to ride. The bigger wheels can be a bit tricky to balance at first, but once you get the hang of it it’s smooth sailing. This is a great scooter and will get a lot of use in the coming summer months.",
    "title": "Great Scooter",
    "posted_at": "2021-07-01 22:58:25.000000 UTC"
  },
  {
    "text": "Stable, smooth and suitable even for the adult.\nEasy to built and carry around.",
    "title": "My first kickboard",
    "posted_at": "2022-07-21 02:57:33.000000 UTC"
  },
  {
    "text": "I am trying to avoid public transportation because of covid. Therefore, the scooter is my new favorite mode of transportation to work. It is easy to use and it very reliable. It is easy to transport because you can just fold it and take it with you. I have no issues with this scooter.",
    "title": "Favorite Scooter",
    "posted_at": "2021-07-14 13:36:06.000000 UTC"
  },
  {
    "text": "This is a great quality scooter. The step area is little wider so my kids feel more stable. It came pretty much assembled, I had to insert the handle bar only. Build quality is very strong and the product is heavy. It looks and feels built to last. The wheels are large that makes riding the scooter very stable. It rides smoothly and its a bigger sturdier scooter. It allows quickly fold and unfold, which is very convenient for younger kids without needing someone's help. The foot grip is strong to make smooth stops.",
    "title": "Sturdy scooter",
    "posted_at": "2021-07-02 16:20:10.000000 UTC"
  },
  {
    "text": "My 12 year old daughter and my 8 year old nephew really love this scooter. With it being 3 wheeled it is much easier to use and much safer in my opinion. The adjustable height handlebars is very convenient and easy to adjust. The wheels glide smoothly on the sidewalk and it is easy to turn by leaning one direction or the other. It seems to be made out of durable materials so I would think that it will take a lot of abuse from the kids.",
    "title": "My kids love it!",
    "posted_at": "2021-08-03 18:39:01.000000 UTC"
  },
  {
    "text": "I got this item for my 6 year old. She loves scooters and she had outgrown her smaller one. I am 100 percent satisfied with this scooter. It lights up really cool. White lights on the wheels. Very slick design. It easily folds up which makes it easy for storing it when it is not being used. The handles turn a lite bit for easy direction change. Very high quality.",
    "title": "Folds up for easy storage",
    "posted_at": "2021-08-06 12:38:15.000000 UTC"
  },
  {
    "text": "The Jetson Triton Kick Scooter is a very high quality scooter! It has 3 wheels so it's easier and safer for kids to ride. It's much more stable than a traditional 2 wheel scooter. Also, the wheels light up when in motion! So much fun to ride!",
    "title": "Jetson Triton Kick Scooter",
    "posted_at": "2021-07-27 14:32:16.000000 UTC"
  },
  {
    "text": "Got this for my daughters 5th birthday and I’m so happy with it!! The quality is great, feels much more sturdier than your typical child scooter. The fact the wheels light up, she was beyond thrilled! It handles well and braking is a breeze. The folding capabilities, make storing it and taking it places super easy. We love this scooter!",
    "title": "Super fun!!",
    "posted_at": "2021-08-03 14:01:35.000000 UTC"
  },
  {
    "text": "Nice quality scooter! You can adjust the height level of the scooter so it could be great for kids and adults. It's made of sturdy, quality material. The scooter does everything it need to. I will be enjoying my rides outside for the rest of the summer!",
    "title": "Quality scooter",
    "posted_at": "2021-08-21 03:26:51.000000 UTC"
  },
  {
    "text": "I got this scooter for the kids but secretly I got it for myself also. It is very different from a standard boring scooter. It has 3 wheels and you turn by shifting your weight from side to side. It is very fast. And the coolest part is the wheels light up when in motion. It is a blast to ride for all the kids and even myself. Definitely the best scooter I have ever seen. Extremely durable and strong. Even as a grown man.",
    "title": "I live it",
    "posted_at": "2021-07-26 16:13:03.000000 UTC"
  },
  {
    "text": "The scooter is very awesome it was super easy to figure out how to use the wheels lineup when it is rolling with his height adjustable it folds up for storage My kids Have even left it outside in the weather and it has not rusted still works like new the wheels still light up and kids love it",
    "title": "Awesome",
    "posted_at": "2021-10-24 00:39:09.000000 UTC"
  },
  {
    "text": "This kickboard is an amazing machine! There was only one con... it was raining out when it came so I couldn’t ride it. But than... wee have had a blast cruising the neighborhood so far and look forward to going further as the weather cools off.",
    "title": "Great product",
    "posted_at": "2021-07-27 23:06:47.000000 UTC"
  },
  {
    "text": "This Triton Kick Scooter has quickly become a family favorite toy. While it’s mostly for my 5 year old son, all of my kids..including the teenagers (and myself) love playing with it through the house. It’s sturdy and well made. It’s easy to adjust the height of the handle and brake with the foot lever. We also love how the front wheels light up! It rides smoothly and steers with ease! It would be the perfect Christmas or birthday gift! I 100% recommend! What a great scooter!",
    "title": "Awesome product!",
    "posted_at": "2021-08-08 03:16:26.000000 UTC"
  },
  {
    "text": "My son has been thrilled with this scooter. It is very sturdy and durable. I like that it has an adjustable height for the handle as well as this made it really user friendly. It’s cool to watch him pick up speed and for it to light well. This is great for kids on the go!",
    "title": "Awesome scooter",
    "posted_at": "2021-08-04 23:38:08.000000 UTC"
  },
  {
    "text": "This is by far our favorite this summer! With the 3 wheels it’s nice for my youngest but easy to ride and smooth so that my middle child loves it too! So easy to adjust the handlebars to each person and just as easy to fold down to put away or bring it with us to the bike trails! When folded down it locked easily into place so I don’t have to worry about it unfolding and hitting you while you carry it. Which was a huge plus for me!",
    "title": "Kids favorite",
    "posted_at": "2021-08-19 17:21:04.000000 UTC"
  },
  {
    "text": "soat the moment we have winter and its very cold out so unfortunatly the lil one has not go to ride it as its very cold outisde but the wheels light up its easy steering as it has a lean steering handle which is cool cannot wait to tske it outside with the little one as im in for it he never going to get off of it",
    "title": "easy ride",
    "posted_at": "2021-12-21 15:47:57.000000 UTC"
  },
  {
    "text": "My daughter has been wanting a scooter ever since her older brother got one and this scooter was just perfect for her. I'm not scared of her getting hurt, it's very stable and the lights in the wheels definitely had her smiling like crazy. My kids are no longer fighting",
    "title": "Happy kids",
    "posted_at": "2022-01-08 15:51:31.000000 UTC"
  },
  {
    "text": "So happy to have got this scooter, my 2 year old tries to ride inside house. The handle bar can be adjusted from shortest to a bit taller.. they love it as they see lights that comes on when the wheels spin.. it’s perfect for them I have a 5 year old and 2 year old kids and they are happy with it.. is not like the classic scooters that falls in the ground to its side.. this can stays up.. parents you would love it as gift for your little ones.. I recommended 100%.\nIt’s got a safe braking system so your kids won’t get hurt playing with it..",
    "title": "Awesome kids scooter",
    "posted_at": "2021-12-27 16:44:58.000000 UTC"
  },
  {
    "text": "This scooter is the most fun for kids ages up to 8. Not only it is ergonomically designed for intuitive riding, but it also is a very cool looking ride. Since we are not getting much snow this year just yet, we are able to enjoy it a little longer. Our kids enjoy riding this new scooter, and they seem to be very sturdy on it, and it delivers a smooth and fun experience right out of the box. Put your helmet on and have fun!",
    "title": "Adorable Scooter",
    "posted_at": "2021-12-25 09:42:57.000000 UTC"
  },
  {
    "text": "Thank you for this opportunity. I was able to try this product for free. I recommend to all family and friends who are looking for a product like this . I look forward to more products from this brand . Thank you again !",
    "title": "Great product",
    "posted_at": "2021-12-18 20:09:21.000000 UTC"
  },
  {
    "text": "Great scooter. My 7 year old son and 3 year old nephew love it. I like how easy it is to assemble, only two pieces to put together. With a click of a button I was able to adjust the height quickly. The kids really like the light up wheels. Great for beginners, nice wide base and they learn how to lean to steer. great scooter, smooth ride.",
    "title": "easy to assemble",
    "posted_at": "2022-02-07 21:15:09.000000 UTC"
  },
  {
    "text": "My kids enjoyed this scooter. The break feature was nice they didn't have to drag their feet to stop. The light up wheels made it fun when the sun was going down as well. The height adjustment was easy to use with a lock to keep from moving.",
    "title": "Fun scooter",
    "posted_at": "2021-12-23 15:55:50.000000 UTC"
  },
  {
    "text": "I got one of those for my daughter, she loves it.\nThanks for kids kick scooter.",
    "title": "Great ride",
    "posted_at": "2021-12-08 01:20:00.000000 UTC"
  },
  {
    "text": "The light up wheels go well with my kids light up shoes. Makes it a lot easier to keep track of them especially with it getting dark earlier. Also like how it folds up for weekends away.",
    "title": "Kids love the lights!",
    "posted_at": "2021-12-06 16:10:39.000000 UTC"
  },
  {
    "text": "J8 came almost fully assembled! From box to road in no time! J8 can easily be folded and stored in a closet or tight space.",
    "title": "Easy to assemble and ride",
    "posted_at": "2022-01-10 19:53:51.000000 UTC"
  },
  {
    "text": "I couldn’t have asked for a better gift! I’ve been an avid cyclist my entire life, partly because I enjoy the scenic routes, and am thoroughly entertained to take in all of what nature has to offer. After an unfortunate horse accident, I have been sidelined for some time now. Just when I thought my bike days were over, this precious gift was dropped off on my stoop.\nIt’s been a great way to feel that wind in my hair while easing back into the world of cycling. The bike is durable, reliable, and it’s sharp look has stopped multiple people in their tracks to ask where they can get one! The gears make it easy to maneuver through my hilly community, and the reflectors give me the ability to ride at night. SAFETY FIRST! Thank you Jetson for coming out with such an amazing product!!!",
    "title": "A movin’ and a groovin’",
    "posted_at": "2022-01-17 20:11:43.000000 UTC"
  },
  {
    "text": "Just got this bike and I am so impressed and happy! The e-bike is so well made and loaded with features. But more importantly it is so fun to ride. Hills are no longer a challenge and I can ride for hours. The seat height is easily adjustable and comfortable. It is fairly portable and when traveling I can quickly fold it and place it in the trunk of my car and take it with me on vacations. I highly recommend this e-bike to anyone.",
    "title": "Time to Ride!",
    "posted_at": "2022-01-11 16:38:25.000000 UTC"
  },
  {
    "text": "This bike is a premium build at a value price point! It is gorgeous in person and rides beautifully, is super easy to fold and transport and just fun to ride. Most bikes at this quality are far more expensive. The assembly was extremely easy and simple, took my husband about 15 minutes to fully put together and they instructions were easy to follow. Truly a great purchase, I will be buying from Jetson again.",
    "title": "Great bike at a great price!",
    "posted_at": "2022-03-09 21:55:27.000000 UTC"
  },
  {
    "text": "I give this bike 5 stars! This is not the first product we have by Jetson and it definitely won't be the last! The quality is above all others. We have the smaller version of these bikes and have enjoyed riding them so much that we had to have the J8. We now have bikes we keep at the beach and some for home! I love the features on this bike! The LCD display is amazing. I can now track the distance we ride and see how fast I am going. Also, since we do not have a lot of storage space, I love how easy they are to fold up. We live in a lake community and these bikes draw a lot of attention when people realize they are electric. Cant say enough about this product... everyone should take one for a spin.",
    "title": "Love the size!",
    "posted_at": "2022-01-11 01:52:06.000000 UTC"
  },
  {
    "text": "Really like the J8. It is built sloid and looks good. Easy to fold and stow. Initially had some electrical issues and called customer service. Very personal service. Fixed the issue immediately and I am back on the road. Good product and good service to back it up. Highly recommend.",
    "title": "Solid Bike",
    "posted_at": "2022-08-30 15:43:43.000000 UTC"
  },
  {
    "text": "I've ridden other electric bikes and the J8 is by far the most comfortable. It was very easy to assemble and it came partially charged so I was able to test ride it immediately...and that was a blast. It can also quickly fold up to a transportable size for anyone wanting to take it on the go. I highly recommend this product!",
    "title": "Great e-bike and very easy assembly!",
    "posted_at": "2022-01-10 15:58:02.000000 UTC"
  },
  {
    "text": "This is my first electric bike and I absolutely love it. Makes running into town for errands or meeting a friend for coffee a snap. The multiple speeds is great to let me choose what kind ride I'd like.\nPutting it together was a breeze. The way it folds up is also super helpful for storage in smaller apartments!",
    "title": "Great Electric Bike!",
    "posted_at": "2022-01-11 01:20:49.000000 UTC"
  },
  {
    "text": "Wow! What a sturdy and well built bike. It is made extremely well and I am so impressed by the paint finish and features. I live in a neighborhood that is quite hilly and I had no trouble navigating the hills with the power assist feature. So easy to use. Can't wait to fold it up and bring on vacation and use it while traveling.",
    "title": "Sturdy and fun!",
    "posted_at": "2022-01-09 23:16:15.000000 UTC"
  },
  {
    "text": "Finally a bike that feels the way it should! I have tried a number of bikes over the last few years and until this one, I always felt like my time riding was limited. Would recommend this bike to anyone looking to go out for longer rides.",
    "title": "Super Comfortable",
    "posted_at": "2022-01-03 16:08:07.000000 UTC"
  },
  {
    "text": "I LOVE this bike! I bought the J8 after moving to Philadelphia and selling my car. While I was nervous to give up my car at first, this bike has made it so easy to travel all over the city. The battery life is great and this bad boy can move! Being able to fold it up and for it to fit into my smaller apartment is a game changer too. The only thing I would change about it is adding some suspension and making it easier to lock up when leaving it in public (it’s a bulky frame so not plausible to lock the tire and the frame together). Now, when I received the bike it was not in “perfect” shape. I did buy it from an authorized retailer so it seemed like it may have been used. I reached out to their customer service and they were very helpful! Once the J8 is back in stock they will be replacing my current bike! So overall an excellent quality bike, great price, and awesome customer service!",
    "title": "Beautiful bike, excellent customer service!",
    "posted_at": "2022-10-17 19:37:42.000000 UTC"
  },
  {
    "text": "Your customer service is terrible. The cameras constantly have different issues. What is the point of a security camera that goes down while on vacation and there is no way to get it back online.You came out with way to many products before perfecting the camera.",
    "title": "",
    "posted_at": "2022-10-24 20:30:14.000000 UTC"
  },
  {
    "text": "The latest update screws everything up. Zero notifications.... Tons of 3001 errors. The support of this app really has gone downhill. About to find a new security system.",
    "title": "",
    "posted_at": "2022-10-24 22:36:12.000000 UTC"
  },
  {
    "text": "First they had widely-known security issues. Now they have reduced content/capabilities on the app unless you pay more. And camera is glitchy (yeah, i updated firmware and app many times). Pass.",
    "title": "",
    "posted_at": "2022-10-25 12:43:05.000000 UTC"
  },
  {
    "text": "Full of spam...",
    "title": "",
    "posted_at": "2022-10-24 19:57:29.000000 UTC"
  },
  {
    "text": "Cameras are unreliable",
    "title": "",
    "posted_at": "2022-10-25 00:38:41.000000 UTC"
  },
  {
    "text": "The app used to work great but I stopped getting notifications all the sudden.",
    "title": "",
    "posted_at": "2022-10-24 23:15:51.000000 UTC"
  },
  {
    "text": "Keeps harassing me to give it a bad review",
    "title": "",
    "posted_at": "2022-10-24 20:54:34.000000 UTC"
  },
  {
    "text": "Bought 2 of these for Christmas. One of the frames was made wrong and broke the seat during install. The other frame had weld berries in the bolt holes, took months to get replacement parts. New parts made it about a week when the handle broke. Had parts replaced several times. Finally got tired of getting parts and fixing, cheap lightweight metal that does not last for kids riding on the sidewalk!",
    "title": "Very poor quality!",
    "posted_at": "2022-05-31 14:54:51.000000 UTC"
  },
  {
    "text": "Needed. New charger\nCustomer service is horrible got one on eBay",
    "title": "Don’t bother",
    "posted_at": "2022-08-26 20:43:57.000000 UTC"
  },
  {
    "text": "It is difficult to turn and the straps broke within the first hour.",
    "title": "Poor design",
    "posted_at": "2021-01-01 19:20:32.000000 UTC"
  },
  {
    "text": "Breaks easily. The straps almost immediately break rendering it useless. It says a certain weight and can’t with stand half of what it says. Would not recommend. This is the second one we purchased thinking maybe it was us but it’s actually how poorly it’s made.",
    "title": "Breaks easily!!!",
    "posted_at": "2022-07-22 22:30:58.000000 UTC"
  },
  {
    "text": "We purchased this and when it arrived one of the seat screw holes was to big and there was a dent witch made it hard to put the bars in. The front wheel was off center causing it to wobble. The return cost is more the original price",
    "title": "Horrible",
    "posted_at": "2021-09-18 14:53:45.000000 UTC"
  },
  {
    "text": "I bought the JetKart 2.0 to use with my Jetson Sphere. When I pull back on the brakes, the hoverboard shuts off and then I'm stuck! It won't power on at all unless I connect it to the charger for a few seconds. I know it's not the battery dying because the hoverboard is fully charged with all the lights showing the battery is charged. I have to roll the Jetkart and Sphere all the way back home just to put it back on the charger. I've tried to recalibrate it when it dies but it gets no power, nothing lights up at all. I emailed customer support days ago and have gotten no response!",
    "title": "JetKart Makes My Jetson Sphere Shut Off! Customer Support Won't Respond!",
    "posted_at": "2021-11-16 03:16:21.000000 UTC"
  },
  {
    "text": "We bought this for my son. The handles are uneven and there is no way to fix them. We were also sent a faulty hoverboard. Jetson said they were sending a new one of each. But we never received the new kart despite being promised a new one and tons of follow up emails. An expensive piece of junk.",
    "title": "terrible product",
    "posted_at": "2022-10-18 02:11:29.000000 UTC"
  },
  {
    "text": "Inner seat cracked 2 days old very cheap plastic says weight limit 250 my daughter is 93 lbs",
    "title": "Disappointed",
    "posted_at": "2021-01-02 17:45:59.000000 UTC"
  },
  {
    "text": "I bought this cart for my grandkids and it lasted for a couple of months. The Velcro strap are a very poor design the don't hold up. And when you go to their website you will see that they are sold out (not available) And have been unavailable for MANY months With out the straps the cart is USELESS !! Don't buy this product unless they provide you with many extra Velcro straps..... The problem is... They can't get them Very strange Very poor design Mad in Chin garbage",
    "title": "Jet Kart product is a bad investment",
    "posted_at": "2022-10-18 02:31:57.000000 UTC"
  },
  {
    "text": "I might stay away from this company due to product quality and poor engineering. From other reviews that seems to be the norm.",
    "title": "Hoverboard attachment - Very Poor",
    "posted_at": "2021-03-14 14:27:21.000000 UTC"
  },
  {
    "text": "Replaced broken rear shock assembly now the other side broke. This whole unit was replaced once. The 2 boys riding both weigh less than 100 lbs",
    "title": "Having troubles",
    "posted_at": "2022-10-18 04:22:34.000000 UTC"
  },
  {
    "text": "Bought the 2.0 after already bought the 1.0. I researched and the Jetson Plasma I have was supposed to be compatible with the 1.0. the board needed to be recalibrated every minute or so with the 1.0. called Jetson and they said the wheel size and blah blah that I should buy the 2.0. great and I bought the 2.0. same exact freaking issue and now the pin in the length adjustment tube doesn't sit properly and keeps falling off. So my board was $150, but he 1.0 was $65.00 and the 2.0 was $60.00. So I am out $275.00 oh I forgot I had to order more straps because the 1.0 straps were garbage and I paid $15.00 for them. So the grand total is $290.00 of junk sitting in the garage. Should have never bought this brand and done my research a bit better. Even trying to stand and ride the board it keeps beeping and I am well in the weight range. I bought all the this stuff in the past 2 months. This is what happens when you don't do your homework kids. Let this be an example of impulse buying.",
    "title": "Trash and Garbage and Basura",
    "posted_at": "2021-08-10 22:42:52.000000 UTC"
  },
  {
    "text": "I bought this for my daughter and the first issue was assembly, we could not fit the seat to the frame because the holes were not lining up. Then the fully charged battery would last 8 minutes. We timed it, it was only eight minutes, for a 60-pound little girl, every time. We tried to contact Jetson, we tried to find a solution but be we left with a useless expensive\nproduct.",
    "title": "Would not buy",
    "posted_at": "2022-06-03 12:10:43.000000 UTC"
  },
  {
    "text": "My kids got these for Christmas. One of the front wheels broke off and the other one quick charging after 1 month of use.",
    "title": "Junk",
    "posted_at": "2022-04-19 03:09:25.000000 UTC"
  },
  {
    "text": "One of the bolts you need to remove to install the kart was so tight, that it could be removed making the product unusable. Threw it in the garbage never used",
    "title": "Unusable out of the box",
    "posted_at": "2022-06-24 22:33:14.000000 UTC"
  },
  {
    "text": "Struts are slightly bent. Hook and loop strap broke after about a week of normal use.",
    "title": "Avoid",
    "posted_at": "2021-01-03 22:30:23.000000 UTC"
  },
  {
    "text": "The bolts that need removed In order to put on the handlebars are completely messed up. One side was tight my husband had\nTo get a breakerbar to loosen it, and the screw was completely stripped. The 2nd side my husband purchased a damaged screw extractor kit and STILL CANNOT remove the screws. He’s worked for over 5 hrs to remove it; and still no luck. This product is completely unusable and a waste of $80.\nHighly disappointed in this product. I would most definitely like to be contacted about a refund or replacement of this kart.",
    "title": "Ridiculous construction",
    "posted_at": "2021-01-10 22:50:56.000000 UTC"
  },
  {
    "text": "We bought the bike for our granddaughter's birthday. We had to give her a bike that did not work. It would not light up. Then we had to take it back to return. Needless to say that is hard to explain to a 5 year old. We are in the process of trying to get it returned. We hope all goes well with the return and she can get a bike she really loved.",
    "title": "Birthday disappointment",
    "posted_at": "2021-10-04 12:17:55.000000 UTC"
  },
  {
    "text": "Need to add a drill and a mallet to needed tools. Had to use mallet to get the handles attached to the frame, there was no way it was going to work doing anything else. Seat had barely pin holes in them for the bolts, had to use drill to widen and then mallet to force them through. Also, the screws on the seat have an order that if not followed, the last one won't go in, took me 3 tries to figure that out. After finally got it together, the foot bar is not even level.\nI will give it that it attached to the board easily.",
    "title": "Assembly instructions need work",
    "posted_at": "2020-12-25 04:07:53.000000 UTC"
  },
  {
    "text": "After 2 days, the seat cracked badly in 2 spots and was unusable. Had to exchange. Suggest 3.0 having a metal seat or stronger/thicker plastic.",
    "title": "Cool adapter, but broke after 1 day.",
    "posted_at": "2020-12-29 13:03:51.000000 UTC"
  },
  {
    "text": "The bike itself is fine. It’s heavy for a small kid. Biggest disappointment is the lights. They don’t work much at all. We had a replacement bike swapped for our original and the lights still don’t work very well.",
    "title": "Ok bike",
    "posted_at": "2022-04-14 22:56:50.000000 UTC"
  },
  {
    "text": "The bike itself is fine. It’s heavy for a small kid. Biggest disappointment is the lights. They don’t work much at all. We had a replacement bike swapped for our original and the lights still don’t work very well.",
    "title": "Ok bike",
    "posted_at": "2022-04-14 22:56:50.000000 UTC"
  },
  {
    "text": "I have had this Jetkart for over two years now. While there were some issues with getting the kart to respond properly to the arm controls because the velcro straps would not always hold on to the hoverboard properly, we learned to live with it and were able to use the kart and were happy with it for over a year. Then the seat cracked and had to replaced. Turns out that Jetson doesn't sell a replacement seat, nothing on eBay or Amazon will replace the seat on this cart because its bolts are at an angle and no one sells a seat that fits the jetkart. So for the last year, it has been lying around waiting to be picked up by bulk trash pickup. I was unwilling to shell out $65-$80 for a new jetkart and could not come up with a solution that fits existing aftermarket seats. So as long as you don't crack the seat, its a decent kart, but buyer beware.",
    "title": "Ran well for a year but no replacement seats :(",
    "posted_at": "2022-05-31 15:32:11.000000 UTC"
  },
  {
    "text": "I have had this Jetkart for over two years now. While there were some issues with getting the kart to respond properly to the arm controls because the velcro straps would not always hold on to the hoverboard properly, we learned to live with it and were able to use the kart and were happy with it for over a year. Then the seat cracked and had to replaced. Turns out that Jetson doesn't sell a replacement seat, nothing on eBay or Amazon will replace the seat on this cart because its bolts are at an angle and no one sells a seat that fits the jetkart. So for the last year, it has been lying around waiting to be picked up by bulk trash pickup. I was unwilling to shell out $65-$80 for a new jetkart and could not come up with a solution that fits existing aftermarket seats. So as long as you don't crack the seat, its a decent kart, but buyer beware.",
    "title": "Ran well for a year but no replacement seats :(",
    "posted_at": "2022-05-31 15:32:11.000000 UTC"
  },
  {
    "text": "Customer service tried to get a working cart to me, which is why there are 2 stars and not 1. The cart doesn’t attach week to the board. Had to “shim” the board to create enough pressure for the board to recognize the cart was attached. Still only worked sporadically.",
    "title": "Cart is trash. Customer service tried their best",
    "posted_at": "2022-05-31 20:40:32.000000 UTC"
  },
  {
    "text": "Customer service tried to get a working cart to me, which is why there are 2 stars and not 1. The cart doesn’t attach week to the board. Had to “shim” the board to create enough pressure for the board to recognize the cart was attached. Still only worked sporadically.",
    "title": "Cart is trash. Customer service tried their best",
    "posted_at": "2022-05-31 20:40:32.000000 UTC"
  },
  {
    "text": "I bought this toy on the 19th.\nOut of the box the cruise control doesn’t work.\nThere’s sloppy paint with chips on the red rear wheel.\nThe front wheel has a clicking sound like a bearing.\nAfter waiting 1 hour the rep who’s name starts with a V and ends with an A wasn’t exactly good at her job.\nI gave 2 stars for looks.",
    "title": "Meh..",
    "posted_at": "2022-08-22 21:07:28.000000 UTC"
  },
  {
    "text": "The first one we bought (yes we bought two) it broke immediately after sitting on it. While the company agreed to send a new one. They had to charge us shipping to send it to our home because we are outside the us. The second one we got worked fine but after a while the handles don’t really work as they should. I would sometimes need to bring the handles very low or very highl and we would need to reset the Hoover board numerous times to get the handles working better. Always the third time riding a piece came a part (a part that I didn’t need to put together). Anyway the attachment is fun but the straps are not wearing out and we have to tighten and adjust the board multiple times when riding. It is fun when it’s fun but we have to do a lot.",
    "title": "Different issues",
    "posted_at": "2022-08-26 19:11:17.000000 UTC"
  },
  {
    "text": "The first one we bought (yes we bought two) it broke immediately after sitting on it. While the company agreed to send a new one. They had to charge us shipping to send it to our home because we are outside the us. The second one we got worked fine but after a while the handles don’t really work as they should. I would sometimes need to bring the handles very low or very highl and we would need to reset the Hoover board numerous times to get the handles working better. Always the third time riding a piece came a part (a part that I didn’t need to put together). Anyway the attachment is fun but the straps are not wearing out and we have to tighten and adjust the board multiple times when riding. It is fun when it’s fun but we have to do a lot.",
    "title": "Different issues",
    "posted_at": "2022-08-26 19:11:17.000000 UTC"
  },
  {
    "text": "Bike didn’t even last a week without me things breaking",
    "title": "Not Durable",
    "posted_at": "2022-08-27 21:18:24.000000 UTC"
  },
  {
    "text": "I’ve had the product for over 1.5 years now and twice the wheel alignment with the tire has gone off and I’m unable to get it fixed and use the product. I am still waiting on a replacement and therefore while the product idea is great, I’m not able to use it optimally.",
    "title": "Good idea, but hasn’t been practical or used due to malfunction",
    "posted_at": "2022-09-15 16:41:36.000000 UTC"
  },
  {
    "text": "I would love to give the Bolt Electric Bike 5 stars because it really is a great little electric bike for kids and adults alike, BUT and it a big BUT...it's impossible to get replacement parts because they are always sold out. Brake pads, tires/tubes, seats, kickstands...it's really bad when a consumer invests in a product like this and can't get parts for it. We've been on a waitlist for brake pads for months and all three of our bikes are completely unusable at the this time.",
    "title": "Replacement parts are impossible to get",
    "posted_at": "2022-10-17 20:01:50.000000 UTC"
  },
  {
    "text": "I love mine I ride it down back roads all the time. I’ve have had it 6 months. I have no complaints",
    "title": "Jetson bolt",
    "posted_at": "2022-10-17 20:13:01.000000 UTC"
  },
  {
    "text": "This was a great product and very fun. It was my daughter’s favorite thing for Christmas to go with her hoverboard. Unfortunately after about an hour of riding the seat split in 2 places.",
    "title": "Great fun product but cheap seat",
    "posted_at": "2020-12-26 01:15:00.000000 UTC"
  },
  {
    "text": "This is a good scooter, and my son has lots of fun with it. But the design is not as intuitive as it should be. The packaging makes it seem like it's super simple to fold and unfold. But honestly, I read the (very short, not clear enough) instructions several times and just couldn't figure it out. I finally got it to unfold, so my son can use it. But now I can't figure out how to fold it for storage.",
    "title": "Good scooter but design is not intuitive",
    "posted_at": "2021-07-23 18:59:50.000000 UTC"
  },
  {
    "text": "I have a 60lbs and 70lbs kids and it still wobbles at around 8 mph. Tried adjust length and air pressure. It helps if they lean into it, especially when accelerating.",
    "title": "Woobles",
    "posted_at": "2021-09-16 00:21:01.000000 UTC"
  },
  {
    "text": "I have a 60lbs and 70lbs kids and it still wobbles at around 8 mph. Tried adjust length and air pressure. It helps if they lean into it, especially when accelerating.",
    "title": "Woobles",
    "posted_at": "2021-09-16 00:21:01.000000 UTC"
  },
  {
    "text": "I just bought a hali x and was wondering if this would work with hali",
    "title": "Needing help",
    "posted_at": "2021-11-11 00:00:16.000000 UTC"
  },
  {
    "text": "I just bought a hali x and was wondering if this would work with hali",
    "title": "Needing help",
    "posted_at": "2021-11-11 00:00:16.000000 UTC"
  },
  {
    "text": "Straps separating that holds velcro and rubber handles will slide off. But kids love it.",
    "title": "Jetcart 2.0",
    "posted_at": "2021-11-18 20:06:28.000000 UTC"
  },
  {
    "text": "Straps separating that holds velcro and rubber handles will slide off. But kids love it.",
    "title": "Jetcart 2.0",
    "posted_at": "2021-11-18 20:06:28.000000 UTC"
  },
  {
    "text": "Within the weight limits and seat broke. They offered a free replacement however because we live in Puerto Rico were were going to be charged like 30-50% the cost of a new one…smh",
    "title": "Seat broke same day",
    "posted_at": "2022-07-25 18:56:07.000000 UTC"
  },
  {
    "text": "Within the weight limits and seat broke. They offered a free replacement however because we live in Puerto Rico were were going to be charged like 30-50% the cost of a new one…smh",
    "title": "Seat broke same day",
    "posted_at": "2022-07-25 18:56:07.000000 UTC"
  },
  {
    "text": "I don’t know much about bikes\nBut my friend mentioned it was missing a piece\nI bought the bike through Kohls and when I call Jetson they said, I had to go through Kohl’s\nThen kohls don’t do exchanges or returns on these bikes\nI guess for the price it’s ok",
    "title": "Love the price but breaks are so loud it’s embarrassing",
    "posted_at": "2022-08-26 19:23:06.000000 UTC"
  },
  {
    "text": "I ordered a refereb directly from Jetson. I received the unit broken. The battery/controller case was hanging from the wires. I contacted Jetson and got another scooter shipped. That 2nd scooter was bulky. Slow and poorly built. Sold both.",
    "title": "I've had 2. Not so impressed.",
    "posted_at": "2022-10-17 19:13:51.000000 UTC"
  },
  {
    "text": "I bought this e-bike about year ago. After the pandemic I didn’t want to take NY subway and decided ride bike to work. It was great in the beginning but I noticed that battery doesn’t last long like I hoped. Sometimes it died in 3-4miles. I wanted to replace a battery and reached out to customer service but they weren’t really helpful. They tried but sometimes it takes few weeks for them to get back to me and other times they gave the information I cannot use (they gave me the link of the battery to purchase but it was invalid). I gave up to replace the battery, it works fine to just ride around my neighbors so I’m good. But I wish they were little more helpful. Overall great bike tho!",
    "title": "Works great for short distance but the battery die quick",
    "posted_at": "2022-10-18 01:28:08.000000 UTC"
  },
  {
    "text": "this a cheap alternative to a go cart and the kids love it. Its works, stable and we haven't had issues with it. Its adjustable for different heights, compact for easy storage. The only issues I have is that the belt attachment goes around the charging port so we would have to work around that to charge our jetson hoover.",
    "title": "easy set up and fun ride",
    "posted_at": "2018-07-03 05:00:00.000000 UTC"
  },
  {
    "text": "Good attachment for the hoverboard my kids enjoy using it",
    "title": "Fun to use",
    "posted_at": "2018-02-25 06:00:00.000000 UTC"
  },
  {
    "text": "Seems well built, but will have to go to hardware store to finish build to make it under the tree. There are no washers for the bolts that attach the seat and the bolt heads slip right through the holes in the seat.",
    "title": "Well built, but missing some parts.",
    "posted_at": "2020-12-14 19:28:27.000000 UTC"
  },
  {
    "text": "We bought this for our son to go with an older model jetson and one for our youngest to go with the newer model jetson. The newer model works great! Actually perfect. The older model, the foot pad centers are farther in than the attachment works for, so unfortunately it does not work quite as well because it sits so far on the edges of the pads, you have to push the levers almost to the ground for them to actually make the hoverboard go forward. If jetson made the bar that the two pads are on adjustable, it would fix this problem. But I guess we'll have to figure something out. If you are purchasing it, I would recommend getting one of the newer hoverboards to go with it. You're taking a chance if you have an older one - crossing your fingers that the pads will hit the right points. If it does, it's an awesome add-on!",
    "title": "Super fun! On the right Jetson hoverboard.",
    "posted_at": "2020-12-27 19:53:59.000000 UTC"
  },
  {
    "text": "This is our second Jetson seat as the first one that came with the hover board was not a good one the front wheel was much smaller and eventually broke off. This new one is much better with the big sturdy front tire which is a great idea, my only issue is the straps to attach the seat to the hoverboard doesn’t last which was also an issue with our last seat. After one day of riding for my now 9 year old son the straps were tearing up and wouldn’t strap properly. we had to replace them for him to be able to ride again. Please come up with a solution to the velcro strap attachment as this is not working. Maybe try something with a ratchet strap or some kind of crank system in the future because when the dirt and dust get in the straps they’re useless. Other that he loves his Jetson all terrain",
    "title": "Great concept but need improving",
    "posted_at": "2021-05-12 10:13:07.000000 UTC"
  },
  {
    "text": "This is our second Jetson seat as the first one that came with the hover board was not a good one the front wheel was much smaller and eventually broke off. This new one is much better with the big sturdy front tire which is a great idea, my only issue is the straps to attach the seat to the hoverboard doesn’t last which was also an issue with our last seat. After one day of riding for my now 9 year old son the straps were tearing up and wouldn’t strap properly. we had to replace them for him to be able to ride again. Please come up with a solution to the velcro strap attachment as this is not working. Maybe try something with a ratchet strap or some kind of crank system in the future because when the dirt and dust get in the straps they’re useless. Other that he loves his Jetson all terrain",
    "title": "Great concept but need improving",
    "posted_at": "2021-05-12 10:13:07.000000 UTC"
  },
  {
    "text": "This is a good item to have handy with the kids during summer outdoors. It keeps them busy and they seemed to like it a lot. It's not too heavy and me and the kids are able to easily carry it wherever we go. The item seems to be made well and is pretty sturdy.",
    "title": "Good For Summertime Fun",
    "posted_at": "2021-07-05 02:24:30.000000 UTC"
  },
  {
    "text": "I got this scooter as a replacement for a smaller scooter. It’s is much bigger than a kid’s scooter. The box says 8+ but it’s too big for my 9 year old boy. It’s even a little too big for my 11 year old. That said the base is wide and has plenty of room to stand on. It’s well made and very sturdy. I worry about fingers getting pinched when it’s folded / opened so we are keeping it open. It’s a great scooter, just not for younger kids.",
    "title": "Great scooter!",
    "posted_at": "2021-07-06 18:15:39.000000 UTC"
  },
  {
    "text": "The Hex Kick Scooter is so light-weight that it's easy to just fold and go! Assembly was a breeze & so far it's been very convenient! I've purchased other scooters in the past that have been heavy & awkward.",
    "title": "Convenient!",
    "posted_at": "2021-07-08 11:13:59.000000 UTC"
  },
  {
    "text": "An excellent gift for any child who likes to explore the outdoors and go fast (relatively)! The brand is quality and this is no exception. It has a durable build and sleek colors. It is stable enough to catch on quickly. Overall a great way to be active and even travel short distances.",
    "title": "Perfect gift and safe",
    "posted_at": "2021-07-20 15:46:48.000000 UTC"
  },
  {
    "text": "Yep, so she was totally loving her Jetson she got for Christmas. Got down the street and just turned the corner and the battery died. It was fully charged the night before. Dang it! But we tried and tried again....got back into the garage. It hasn't moved since. She was embarrassed by some neighbor kids. I will be looking at the bikes. She's 11 going on 16 so she'd enjoy something a little higher from the ground.",
    "title": "WOO HOO, wait what??!!",
    "posted_at": "2022-03-10 21:43:46.000000 UTC"
  },
  {
    "text": "Yep, so she was totally loving her Jetson she got for Christmas. Got down the street and just turned the corner and the battery died. It was fully charged the night before. Dang it! But we tried and tried again....got back into the garage. It hasn't moved since. She was embarrassed by some neighbor kids. I will be looking at the bikes. She's 11 going on 16 so she'd enjoy something a little higher from the ground.",
    "title": "WOO HOO, wait what??!!",
    "posted_at": "2022-03-10 21:43:46.000000 UTC"
  },
  {
    "text": "Great for children weighing under 100 Lbs. Heavier adult “Big children” cause light weight aluminum frame to crack. Awesome product, super fun and easy to ride.",
    "title": "Great fun!",
    "posted_at": "2022-04-21 00:11:13.000000 UTC"
  },
  {
    "text": "Great for children weighing under 100 Lbs. Heavier adult “Big children” cause light weight aluminum frame to crack. Awesome product, super fun and easy to ride.",
    "title": "Great fun!",
    "posted_at": "2022-04-21 00:11:13.000000 UTC"
  },
  {
    "text": "We did buy our Eris scooter and sadly got an error code on the first ride. We were so bummed. But we contacted cutomer service and they sent us a sticker to ship it back instantly. We got word that they were shipping us a replacement. I fully believe we got one of those sad lemons. It happens right with any kind of product. Won't hold it against Jetson. My kiddo says he has the best scooter in the 5th grade!!! I personally love the handle that folds down for easy transportation if I need to pick him up farther away and I like the lights on it for safety. He likes the speed and the screen showing battery life and speed going.",
    "title": "great customer service",
    "posted_at": "2022-06-03 20:45:45.000000 UTC"
  },
  {
    "text": "Been driving a around the neighborhood for a month or two now. Everything is great except the brakes squeak like crazy and it won’t make it uphill once the battery gets to 25%.",
    "title": "Fun",
    "posted_at": "2022-08-29 07:35:19.000000 UTC"
  },
  {
    "text": "We really like our bikes. We take them camping and on short (3-6 miles) rides. They are perfect for this.\nWe had a problem with one bike and they willingly replaced it. However, it took nearly two months for this to happen with several missteps and delays. Customer service typically took 1-2 days for replies. Should be better. 5 ⭐️ for bike, 2 ⭐️ for slow service.",
    "title": "Love the bikes, customer service a bit slow",
    "posted_at": "2022-08-30 10:21:18.000000 UTC"
  },
  {
    "text": "I bought this for my daughter last year as a Christmas gift. In May, it started glitching and wouldn’t work. After getting in touch with Customer Support, they replaced the scooter at no cost. Very friendly and helpful. We have had the replacement since June and haven’t had any problems so far.",
    "title": "Great warranty. Super smooth and fast speed!",
    "posted_at": "2022-09-15 16:14:39.000000 UTC"
  },
  {
    "text": "I bought the Jetson Eris X 2 about a month ago. The first one was great and my boys love it. The kinda flimsy back fender snapped off, but the light still works. I’m struggling to find any replacement parts for it so we have a light on the back for night riding. Eris #2 quit within several city blocks after being fully charged, but I give full credit to the company for paying return shipping and sending me out a new one. It is supposed to arrive tomorrow. Overall I would buy again",
    "title": "Jetson Eris",
    "posted_at": "2022-09-15 16:14:50.000000 UTC"
  },
  {
    "text": "I bought this for my last mile commute for certain times of the year. It was a great price, folds up and fits in my vehicle, and is easy to carry once I arrive at my detination.",
    "title": "Gets me where I need to go",
    "posted_at": "2022-09-15 16:52:01.000000 UTC"
  },
  {
    "text": "I love riding my Bolt. I bought accessories from other places: mirror, horn, phone carrier. The onboard mapping and data recording is a great feature. But after 2 yrs the battery died and Jetson couldn’t help. I found a compatible battery online, had to buy a power plug adaptor plus re-wire the charging port. It worked great but then the hand throttle broke. Once again I must self repair. Jetson support people are very nice but overall I have to do this myself. I would recommend if you understand it won’t last long.",
    "title": "Fun to ride but not to repair",
    "posted_at": "2022-09-15 19:15:29.000000 UTC"
  },
  {
    "text": "Bought this 2 months ago and love it. It’s great for getting to work and back. Battery seems to hold charge well and lights and brake work good. Lots of comments from people when I ride. And I’m 60 but it’s not stopping me. My only regret is winter is coming and I have to put it away for a while.",
    "title": "A zippy little ride",
    "posted_at": "2022-09-17 21:59:17.000000 UTC"
  },
  {
    "text": "It's a nice little e-bike that helps you to get around. It doesn't take up a lot of space and is easy to store. One full charge lasts for quite long.",
    "title": "Nice little e-bike",
    "posted_at": "2022-09-20 03:00:12.000000 UTC"
  },
  {
    "text": "Love how it folds to fit in a compact space. Wish it went a little faster but still fun to ride. Great price!!!",
    "title": "Love my Bolt",
    "posted_at": "2022-09-21 22:23:06.000000 UTC"
  },
  {
    "text": "I bought my Jetson and once I got on, I couldn't stop riding.",
    "title": "All out cool product!",
    "posted_at": "2022-09-29 19:53:22.000000 UTC"
  },
  {
    "text": "The bike is portable and pretty lightweight. I did need to get a longer seat post as I am 5'8\" and for short jaunts this bike is fine but to go too far it is very uncomfortable due to handle bars being for shorter people. I see many youngster on these bikes. Not sure they are really great for full size adults.",
    "title": "Short Rides are good",
    "posted_at": "2022-10-05 14:54:43.000000 UTC"
  },
  {
    "text": "I bought this a few months ago. I ride around the neighborhood and on bike paths. It's easy and as it only weighs 40 pounds i can better handle it",
    "title": "Lightweight and handleable",
    "posted_at": "2022-10-17 20:10:36.000000 UTC"
  },
  {
    "text": "This accessory made riding my sons hoverboard even more fun. He was able to do all types spin outs and so on.",
    "title": "Awesome product",
    "posted_at": "2018-07-13 05:00:00.000000 UTC"
  },
  {
    "text": "We have had multiple carts for our hover boards and this is the only one to survive a week! After many hard and fast rides in grass, gravel, cement, and asfault this kart* has been solid where others have broken in multiple ways! This is best on the market! Hands down perfect!",
    "title": "Perfect choice",
    "posted_at": "2018-07-11 05:00:00.000000 UTC"
  },
  {
    "text": "Son loves riding this at our house. Goes good on the concrete",
    "title": "Works great for my 7 year old",
    "posted_at": "2018-06-17 05:00:00.000000 UTC"
  },
  {
    "text": "Made very durable and is so much fun for the whole family",
    "title": "Lots of fun",
    "posted_at": "2018-03-25 05:00:00.000000 UTC"
  },
  {
    "text": "This is a great little hoverboard attachment. It is extremely well built and very easy to attach to the hoverboard. It is easily adjustable to be able to accommodate my youngest child all they way up to me. AND this thing is FUN!! I highly recommend!",
    "title": "Excellent!",
    "posted_at": "2018-03-08 06:00:00.000000 UTC"
  },
  {
    "text": "I found this to be the best addition to my hover board.",
    "title": "GREAT",
    "posted_at": "2018-02-23 06:00:00.000000 UTC"
  },
  {
    "text": "Fits great on Jetson board and the adjustable length makes it perfect for kids 5 to 59. Glad we got this for sons Christmas present.",
    "title": "Awesome attachment to extend fun with hover board",
    "posted_at": "2018-01-20 06:00:00.000000 UTC"
  },
  {
    "text": "Bought this for my 11 year old grandson because he wanted the hover board. This balancer made it the perfect gift so we don't have to worry about any broken bones!",
    "title": "Makes for a perfect ride!",
    "posted_at": "2018-01-17 06:00:00.000000 UTC"
  },
  {
    "text": "We purchased this a year after buying the hover board. It assembled easily and worked very well. We are looking forward to warmer weather so we can use this outside.",
    "title": "Easy to use",
    "posted_at": "2018-01-13 06:00:00.000000 UTC"
  },
  {
    "text": "We received it in very good packaging. We were able to get it out together.",
    "title": "Hoverboard seat!",
    "posted_at": "2020-12-07 22:48:35.000000 UTC"
  },
  {
    "text": "Bought 2 for Christmas as well as 2 Jetson hoverboards, for my 45lb 5 year old and my 90lb 9 year old boys. These carts are very well made with 2 tube supports, low profile handles and a bucket seat that the boys find comfortable. The shocks on the back help stabilize the cart and the larger than standard front wheel make it a great gift. Dont skimp on the hoverboard. Spend a little more and get a Jetson. These carts are very fast. My 5 year old runs his wideopen like a little Chase Elliott. I will only buy Jetson from now on.",
    "title": "Perfect fit for a 5 year old up to adult. Great product",
    "posted_at": "2021-01-07 02:09:40.000000 UTC"
  },
  {
    "text": "The JetKart 2.0 Universal is quite remarkable. It rides great. Only thing missing that'll set it all the way on fire is the light wheel, the one like the other JetKart has that lights when it's spun. Oh and I jus noticed the wheel is actually air pumped n not that hard plastic. Still 5stars even without the light wheel...GREAT JOB JETSON!!",
    "title": "ATA",
    "posted_at": "2021-05-06 02:16:26.000000 UTC"
  },
  {
    "text": "This is a great quality scooter. It is a beautiful green color with bigger wheels than a traditional scooter is. It is very easy to use and my kids are happy to have this. With this beautiful weather it is a wonderful addition for outside play.",
    "title": "Great quality",
    "posted_at": "2021-06-28 22:31:20.000000 UTC"
  },
  {
    "text": "My 8 year old daughter loves this scooter! It’s heavy and such good quality. The wheels are so smooth and it was super easy to assemble. My daughter says that it feels very sturdy and fast and that it’s easily the best scooter she’s ever had! So awesome!",
    "title": "So nice!",
    "posted_at": "2021-06-29 13:57:28.000000 UTC"
  },
  {
    "text": "I got this for my daughter and she absolutely loves it. Her last scooter had small tires and the handle bars didnt raise up enough for her but this one is great the handle bars are adjustable and the tires are bigger it also has a kick stand . She is absolutely ecstatic about it I cant get her off of it she just wants to keep riding it",
    "title": "Love it",
    "posted_at": "2021-06-29 21:03:38.000000 UTC"
  },
  {
    "text": "This is super easy to put together straight out of the box. The rubberized wheels are smooth. It even has a kick stand which is super convenient. Non slip finish. The handlebar is also adjustable for height.",
    "title": "Adjustable",
    "posted_at": "2021-06-30 00:39:21.000000 UTC"
  },
  {
    "text": "Got thia for my son and its pretty cool. Was able to adjust it to fit him perfect. Rides very smoothly and is very sturdy very easy for him to steer. Very happy with this product over all. Cant wait to get the other kids one to now.",
    "title": "Cool for little kids",
    "posted_at": "2021-06-30 05:07:54.000000 UTC"
  },
  {
    "text": "The red Hex scooter that I got was pretty light weight-wise and the durability factor seems to be well-built. This scooter product is for my 8-year son and daughter to share during the summer months. It seems to be pretty-well assembled and definitely lives up to the fun factor. The handle is sturdy and the wheels are well-aligned and tempered. My kids love the fun factor and always wanted to have a scooter that fit their active needs. This scooter by Jetson seems to do the job just fine and I think it will be a well-cherished product in our family. This scooter works well and the manufacturer needs to advertise this product more prominently in stores or websites. It's a fine product and works well. Thanks!",
    "title": "Great Scooter for Kids!",
    "posted_at": "2021-06-30 07:59:09.000000 UTC"
  },
  {
    "text": "I like how smooth it rides and how well it holds up. It is a very sturdy scooter and holds up to 220 pounds. The wheels are bigger so easier to use. If you are looking for a scooter this is the one to get",
    "title": "great features",
    "posted_at": "2021-06-30 18:33:05.000000 UTC"
  },
  {
    "text": "I received this and gave it to my grandson,who's 9.It is a cool green color and he loves it!He caught the hang of it right away and has been riding up and down the street.I'd say it's a hit!I would definitely recommend it.",
    "title": "awesome!",
    "posted_at": "2021-07-01 02:49:52.000000 UTC"
  },
  {
    "text": "I love this scooter. Love that it has the bigger wheels which makes it easier to keep your balance on. The wide foot pad is big for both of my kids feet. It is easy to adjust in height so your child or an adult can ride. Love the neon green color of mine. Very high quality and durable. My daughter loves it. Great priduct i highly recommend this to anyone looking to get their older child a new one.",
    "title": "Great product",
    "posted_at": "2021-07-01 09:25:50.000000 UTC"
  },
  {
    "text": "This scooter is really well made and looks really sharp. I got this for my 11 year old but it will support an adult with no problem. The big wheels make it handle bumps and rocks with ease. The grips are made out of rubber like a quality bike grips and the deck has quality grip tape on it.",
    "title": "Well made scooter",
    "posted_at": "2021-07-01 16:15:06.000000 UTC"
  },
  {
    "text": "The Hex kick scooter is so much fun to ride. Us adults and kids take turns riding it around. It rides really smooth. The base that you stand on is spacious and very sturdy. The big wheels are really cool. I definitely will be purchasing a few of this exact scooter for each kid.",
    "title": "Great Features",
    "posted_at": "2021-07-01 17:17:38.000000 UTC"
  },
  {
    "text": "The Jetson Hex scooter is perfect for the “big kid” that have outgrown traditional scooters. It has a weigh limit of 220 lbs so it’s even suitable for an adult to ride. The assembly was very simple. Just pop on the handlebars and screw them in and it’s good to go. It’s very sturdy and easy to ride. The bigger wheels can be a bit tricky to balance at first, but once you get the hang of it it’s smooth sailing. This is a great scooter and will get a lot of use in the coming summer months.",
    "title": "Great Scooter",
    "posted_at": "2021-07-01 22:58:25.000000 UTC"
  },
  {
    "text": "I received this AMAZING scooter to review!!!! I wanted my niece to ride the scooter because she LOVES scooters and she absolutely LOVED it! I really liked that fact that the wheels were bigger than a normal scooter. It made me feel like it was a little safer. I LOVE the color of the scooter! I would definitely recommend this scooter!",
    "title": "My niece LOVED it!",
    "posted_at": "2021-07-02 07:05:53.000000 UTC"
  },
  {
    "text": "I got this for my 11 year old daughter and she absolutely loves it the bigger wheels allow for easier balance the brakes work really well the steering is smooth it has became her favorite outside toy and with that I'm one happy mom because it's so hard to get these kids outside",
    "title": "Kids fav",
    "posted_at": "2021-07-02 15:11:15.000000 UTC"
  },
  {
    "text": "This Hex Kick Scooter is wonderful. My daughter loves it and loves the color. Easy to put together and use. Nice ride. Very durable. I would recommend this to anyone who has kids. We love ours..",
    "title": "Great Product",
    "posted_at": "2021-07-02 15:17:28.000000 UTC"
  },
  {
    "text": "I got this for my grandson and he loves the scooter. He had a smaller spiderman one but got to big. He said I feel like a big boy now grandma. The Hex scooter was easy to put together and my grandson had a ball on it. I got the red and black one and them are his favorite colors. Thank you for letting me try your product.",
    "title": "Cool Ride",
    "posted_at": "2021-07-02 15:18:16.000000 UTC"
  },
  {
    "text": "This is a great quality scooter. The step area is little wider so my kids feel more stable. It came pretty much assembled, I had to insert the handle bar only. Build quality is very strong and the product is heavy. It looks and feels built to last. The wheels are large that makes riding the scooter very stable. It rides smoothly and its a bigger sturdier scooter. It allows quickly fold and unfold, which is very convenient for younger kids without needing someone's help. The foot grip is strong to make smooth stops.",
    "title": "Sturdy scooter",
    "posted_at": "2021-07-02 16:20:10.000000 UTC"
  },
  {
    "text": "This scooter looks stunning! The colors and design look so beautiful. It was very easy to set up and took me less than 10 minutes. My kids are having a blast riding it around. It glides smooth on the cement and functions just as it should.",
    "title": "Beautiful scooter",
    "posted_at": "2021-07-02 19:39:16.000000 UTC"
  },
  {
    "text": "The Hex Big Wheel Kick Scooter is really, really nice. It is foldable which makes it easy to take with you where ever you go. The Hex Scooter has comfort grip handles and the handle bars are height adjustable from 35.6\" - 39.2\". The Hex Scooter has a durable frame, 8\" wheels, 6\" Wide Deck, and a rear foot break. The weight limit is 220 lbs so not only kids can enjoy riding this awesome Hex Scooter, adults can enjoy riding it as well. The Hex Big Wheel Kick Scooter is a really fun scooter and it rides really smooth. My youngest son is 9 years old with Autism and is non verbal. He owns two other scooters with smaller wheels that for some reason he cannot ride them so well, but the Hex Big Wheel Kick Scooter the first time that he tried it out he was able to control it well and he now rides it every day through the house. I think the big wheels makes the Hex Big Wheel Kick Scooter ride smoother then the scooters with smaller wheels. The Hex Big Wheel Kick Scooter is so awesome! My whole family of four enjoy riding it! We absolutely love the Hex Big Wheel Kick Scooter! I am going to purchase one for each of us! I give the Hex Big Wheel Kick Scooter an A+++",
    "title": "Smooth Ride",
    "posted_at": "2021-07-03 06:21:22.000000 UTC"
  },
  {
    "text": "I have a 10 year old daughter who fell in love with this scooter the moment she seen it for her birthday! It is the perfect height and lightweight for her to carry if she needs to. We love the design and how it has led lights for at night. Definitely a winner in my household!",
    "title": "Excellent",
    "posted_at": "2021-07-04 15:34:18.000000 UTC"
  },
  {
    "text": "My kids have been using their new scooter for about 5 days now. This thing is extremely durable and rides really smoothly. We have a few electric scooters also and while we enjoy using those, I enjoy not having to remember to put them on the charger and add them to our electric bill. This scooter is perfect because it allows for great exercise and is suitable for young children or teens up to 110 pounds. It folds up nicely to allow to easy storage. We love it!",
    "title": "Kids love it",
    "posted_at": "2021-07-05 12:54:41.000000 UTC"
  },
  {
    "text": "I got this product a few weeks ago and I am glad I did. Our son has enjoyed riding this. It has firm comfort grips on the handles. It is very durable. I was surprised at how the rear foot brake works. This was a good feature. I love how it folds down and is portable.",
    "title": "Great ride!!",
    "posted_at": "2021-07-05 22:41:34.000000 UTC"
  },
  {
    "text": "These scooters are so much fun. My kids and even I love them. They are very easy to put together just a couple screws and they ready to go. They go fast and very smoothly and easy to balance on them. Fun fun fun!",
    "title": "So fun",
    "posted_at": "2021-07-06 21:50:37.000000 UTC"
  },
  {
    "text": "I really liked the product, my granddaughter is delighted with the scooter the handlebar adjuster is suitable for different ages of child. The color is beautiful and it is modern and it is also of very good quality. I highly recommend it",
    "title": "Scooter",
    "posted_at": "2021-07-07 01:22:03.000000 UTC"
  },
  {
    "text": "My 8 year old absolutely loves this scooter! We’ve had it for a couple weeks now and he uses it daily. The larger wheels make for a much easier ride than his other scooter- they ride over large cracks with ease. He has it on the lowest height handlebars, but the higher settings could easily fit a much taller kid. The blue color looks really nice and the scooter is really well made. It seems like it’ll hold up to whatever he puts it through.",
    "title": "Couldn’t be better",
    "posted_at": "2021-07-07 01:55:14.000000 UTC"
  },
  {
    "text": "This scooter is so cute and my daughter loves it. The color is pretty. The scooter is very well made. Great quality. It was way better than I expected. Its bigger than most scooters which is great. My almost 13 year old can ride it comfortably.",
    "title": "So cute",
    "posted_at": "2021-07-08 16:05:50.000000 UTC"
  },
  {
    "text": "My daughter LOVES this scooter, she has been riding it non stop through the neighborhood. She loves the vibrant hot pink color too ... I am impressed by her quality, made with a solid steel frame, and very strict and adjustable (would fit a 6 year old through a small sized adult). Easy to assemble, perfect birthday gift.",
    "title": "My 9 year old is obsessed",
    "posted_at": "2021-07-08 17:45:11.000000 UTC"
  },
  {
    "text": "I am very happy with this scooter. It has a vibrant color to it and rides very smooth. It has a kick stand which was a really cool added bonus. Turns easily and has different heights for the handle bars.",
    "title": "Pretty nice scooter",
    "posted_at": "2021-07-09 14:32:07.000000 UTC"
  },
  {
    "text": "Got this as a replacement for my son's regular scooter. While it doesn't seem capable of doing as many \"tricks\" as other brands, overall it's a much better scooter. It's built sturdy and it's quite a bit larger than standard scooters. That's primarily the reason we got it anyway. The platform you stand on has a larger surface area allowing you to stay on it & upright easier. The wheels are large and of a much softer material than others. It rides down the street a lot quieter than his previous scooter. Overall, this thing is great. It even has a kickstand so you don't have to just drop it on the ground when you're done.",
    "title": "Son loves it",
    "posted_at": "2021-07-09 20:43:34.000000 UTC"
  },
  {
    "text": "I really enjoyed the kick scooter from Hex. What I liked most about this product is how well made it is. Compared to other s, this scooter is very well made. It isn't flimsy at all. The handle on it adjusts to your liking. It has a break on the back , in case you need to stop on it. The colors make the scooter pop while riding outside. It catches many eyes while going by on it and we got several ohhs and ahhs. My kids enjoyed the scooter and had loads of fun on it. You can ride it just on about anything. Grass, cement, pavement. The scooter won't let you down. I will recommend this product to family and friends. Thank you!",
    "title": "Off in a scoot!",
    "posted_at": "2021-07-10 04:25:33.000000 UTC"
  },
  {
    "text": "I am trying to avoid public transportation because of covid. Therefore, the scooter is my new favorite mode of transportation to work. It is easy to use and it very reliable. It is easy to transport because you can just fold it and take it with you. I have no issues with this scooter.",
    "title": "Favorite Scooter",
    "posted_at": "2021-07-14 13:36:06.000000 UTC"
  },
  {
    "text": "I recently got the hot pink one for my niece it is so amazing and great rides smooth super fast she loves it and the color easy to assemble and take apart the handle has many different settings for different size kiddos I will def recommend this to anyone with adventures kiddos.",
    "title": "Great ride",
    "posted_at": "2021-07-19 07:04:38.000000 UTC"
  },
  {
    "text": "When I ordered this scooter I was thinking about my kids at first, but when it arrived I realized it was big enough and sturdy enough for me! (Bonus). The wheels are solid and remind me more of skateboard wheels. The board that you stand on is fairly wide and easily has space for both feet (even if they are large). The weight limit on this scooter is 220 pounds. The board also has some good grip/deck tape on it so that your feet don't slip. The whole scooter is extremely sturdy and I'd like to take it to the local skate park in the near future to try it out there. Overall, very satisfied with this scooter!",
    "title": "Durable and Large Scooter",
    "posted_at": "2021-07-21 05:33:15.000000 UTC"
  },
  {
    "text": "First off it came very well packaged it's a really awesome bike it has a has lights on the tires and even down on the training wheels the lights go down in the bars of the bike which is the body it's a really nice bike it is very adorable it's very strong and your children or grandchildren would love you for it is very awesome it was very easy to put together it was a very good value is also good quality everything that you need it came with it your tires light up even down to the training wheels it is really awesome your children would enjoy this for hours and hours on in this is great for birthdays this is great for also For Christmases are just a gift they would really enjoy it's even awesome because you could take off the training wheels once they get used to riding a bike it has a bell on it that they can ring as they playing with their bicycle and riding it they have lights on the inside of the tires as well as the training wheels and even down the body of it the seat is very comfortable for him they would really enjoy it if they're out in the dark is easier for someone to see them because of the lights which is a big plus",
    "title": "Great fun",
    "posted_at": "2021-07-21 20:37:53.000000 UTC"
  },
  {
    "text": "First off it came very well packaged it's a really awesome bike it has a has lights on the tires and even down on the training wheels the lights go down in the bars of the bike which is the body it's a really nice bike it is very adorable it's very strong and your children or grandchildren would love you for it is very awesome it was very easy to put together it was a very good value is also good quality everything that you need it came with it your tires light up even down to the training wheels it is really awesome your children would enjoy this for hours and hours on in this is great for birthdays this is great for also For Christmases are just a gift they would really enjoy it's even awesome because you could take off the training wheels once they get used to riding a bike it has a bell on it that they can ring as they playing with their bicycle and riding it they have lights on the inside of the tires as well as the training wheels and even down the body of it the seat is very comfortable for him they would really enjoy it if they're out in the dark is easier for someone to see them because of the lights which is a big plus",
    "title": "Great fun",
    "posted_at": "2021-07-21 20:37:53.000000 UTC"
  },
  {
    "text": "This review is for JLR M Light-Up Kids Bike. The assembly was very easy about 10 minutes to get everything together. The bike is very light and rides smoothly. The training wheels also light up, which is a really cool feature. They are good quality training wheels and don't rattle a lot.",
    "title": "Great idea",
    "posted_at": "2021-07-22 00:16:22.000000 UTC"
  },
  {
    "text": "This review is for JLR M Light-Up Kids Bike. The assembly was very easy about 10 minutes to get everything together. The bike is very light and rides smoothly. The training wheels also light up, which is a really cool feature. They are good quality training wheels and don't rattle a lot.",
    "title": "Great idea",
    "posted_at": "2021-07-22 00:16:22.000000 UTC"
  },
  {
    "text": "This bike is awesome!! My 7 year old son is a huge bike lover. This is small for him but it’s the perfect “trick” bike to use on his jumps. The bike has multiple color settings. It also comes with two packs of lights that attach to the wheels light light up when riding. I highly recommend this bike. Easy assembling and a head turner for sure!",
    "title": "Awesome Features",
    "posted_at": "2021-07-22 16:14:21.000000 UTC"
  },
  {
    "text": "This bike is awesome!! My 7 year old son is a huge bike lover. This is small for him but it’s the perfect “trick” bike to use on his jumps. The bike has multiple color settings. It also comes with two packs of lights that attach to the wheels light light up when riding. I highly recommend this bike. Easy assembling and a head turner for sure!",
    "title": "Awesome Features",
    "posted_at": "2021-07-22 16:14:21.000000 UTC"
  },
  {
    "text": "My daughter has a bike that she doesn’t feel comfortable riding, so we wanted to try something else. This bike was so incredibly simple to put together right out of the box. Everything you need is right in the box! My daughter got on the bike easily. She took off with confidence right away! Such a smooth ride! Most bikes with training wheels are wobbly, which is what made my daughter nervous to ride. Not this bike! The training wheels are almost like rollerblade wheels. So smooth! My daughter also loved the purple color and flashing lights. I have a feeling she’ll be riding without training wheels before we know it because of this great bike!",
    "title": "Smooth ride!",
    "posted_at": "2021-07-22 23:47:48.000000 UTC"
  },
  {
    "text": "My daughter has a bike that she doesn’t feel comfortable riding, so we wanted to try something else. This bike was so incredibly simple to put together right out of the box. Everything you need is right in the box! My daughter got on the bike easily. She took off with confidence right away! Such a smooth ride! Most bikes with training wheels are wobbly, which is what made my daughter nervous to ride. Not this bike! The training wheels are almost like rollerblade wheels. So smooth! My daughter also loved the purple color and flashing lights. I have a feeling she’ll be riding without training wheels before we know it because of this great bike!",
    "title": "Smooth ride!",
    "posted_at": "2021-07-22 23:47:48.000000 UTC"
  },
  {
    "text": "We got this bike for my daughter. She loves the bike. The way it lights up and looks is super cool! It was pretty simple to put together but definitely have to spend a little time doing that. She will be enjoying it all summer.",
    "title": "Cool bike",
    "posted_at": "2021-07-25 16:31:40.000000 UTC"
  },
  {
    "text": "We got this bike for my daughter. She loves the bike. The way it lights up and looks is super cool! It was pretty simple to put together but definitely have to spend a little time doing that. She will be enjoying it all summer.",
    "title": "Cool bike",
    "posted_at": "2021-07-25 16:31:40.000000 UTC"
  }
]